Microchip-MPLAB-Harmony/reference_apps/apps/pic32cx_sg61_cult/pic32cx_sg61_getting_started/firmware/src/packs/PIC32CX1025SG61128_DFP/component/sdhc.h
/*
 * Component description for SDHC
 *
 * Copyright (c) 2022 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2022-09-16T16:25:28Z */
#ifndef _PIC32CXSG61_SDHC_COMPONENT_H_
#define _PIC32CXSG61_SDHC_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR SDHC                                         */
/* ************************************************************************** */

/* -------- SDHC_ACESR : (SDHC Offset: 0x3C) ( R/ 16) Auto CMD Error Status -------- */
#define SDHC_ACESR_RESETVALUE                 _UINT16_(0x00)                                       /*  (SDHC_ACESR) Auto CMD Error Status  Reset Value */

#define SDHC_ACESR_ACMD12NE_Pos               _UINT16_(0)                                          /* (SDHC_ACESR) Auto CMD12 Not Executed Position */
#define SDHC_ACESR_ACMD12NE_Msk               (_UINT16_(0x1) << SDHC_ACESR_ACMD12NE_Pos)           /* (SDHC_ACESR) Auto CMD12 Not Executed Mask */
#define SDHC_ACESR_ACMD12NE(value)            (SDHC_ACESR_ACMD12NE_Msk & (_UINT16_(value) << SDHC_ACESR_ACMD12NE_Pos)) /* Assigment of value for ACMD12NE in the SDHC_ACESR register */
#define   SDHC_ACESR_ACMD12NE_EXEC_Val        _UINT16_(0x0)                                        /* (SDHC_ACESR) Executed  */
#define   SDHC_ACESR_ACMD12NE_NOT_EXEC_Val    _UINT16_(0x1)                                        /* (SDHC_ACESR) Not executed  */
#define SDHC_ACESR_ACMD12NE_EXEC              (SDHC_ACESR_ACMD12NE_EXEC_Val << SDHC_ACESR_ACMD12NE_Pos) /* (SDHC_ACESR) Executed Position  */
#define SDHC_ACESR_ACMD12NE_NOT_EXEC          (SDHC_ACESR_ACMD12NE_NOT_EXEC_Val << SDHC_ACESR_ACMD12NE_Pos) /* (SDHC_ACESR) Not executed Position  */
#define SDHC_ACESR_ACMDTEO_Pos                _UINT16_(1)                                          /* (SDHC_ACESR) Auto CMD Timeout Error Position */
#define SDHC_ACESR_ACMDTEO_Msk                (_UINT16_(0x1) << SDHC_ACESR_ACMDTEO_Pos)            /* (SDHC_ACESR) Auto CMD Timeout Error Mask */
#define SDHC_ACESR_ACMDTEO(value)             (SDHC_ACESR_ACMDTEO_Msk & (_UINT16_(value) << SDHC_ACESR_ACMDTEO_Pos)) /* Assigment of value for ACMDTEO in the SDHC_ACESR register */
#define   SDHC_ACESR_ACMDTEO_NO_Val           _UINT16_(0x0)                                        /* (SDHC_ACESR) No error  */
#define   SDHC_ACESR_ACMDTEO_YES_Val          _UINT16_(0x1)                                        /* (SDHC_ACESR) Timeout  */
#define SDHC_ACESR_ACMDTEO_NO                 (SDHC_ACESR_ACMDTEO_NO_Val << SDHC_ACESR_ACMDTEO_Pos) /* (SDHC_ACESR) No error Position  */
#define SDHC_ACESR_ACMDTEO_YES                (SDHC_ACESR_ACMDTEO_YES_Val << SDHC_ACESR_ACMDTEO_Pos) /* (SDHC_ACESR) Timeout Position  */
#define SDHC_ACESR_ACMDCRC_Pos                _UINT16_(2)                                          /* (SDHC_ACESR) Auto CMD CRC Error Position */
#define SDHC_ACESR_ACMDCRC_Msk                (_UINT16_(0x1) << SDHC_ACESR_ACMDCRC_Pos)            /* (SDHC_ACESR) Auto CMD CRC Error Mask */
#define SDHC_ACESR_ACMDCRC(value)             (SDHC_ACESR_ACMDCRC_Msk & (_UINT16_(value) << SDHC_ACESR_ACMDCRC_Pos)) /* Assigment of value for ACMDCRC in the SDHC_ACESR register */
#define   SDHC_ACESR_ACMDCRC_NO_Val           _UINT16_(0x0)                                        /* (SDHC_ACESR) No error  */
#define   SDHC_ACESR_ACMDCRC_YES_Val          _UINT16_(0x1)                                        /* (SDHC_ACESR) CRC Error Generated  */
#define SDHC_ACESR_ACMDCRC_NO                 (SDHC_ACESR_ACMDCRC_NO_Val << SDHC_ACESR_ACMDCRC_Pos) /* (SDHC_ACESR) No error Position  */
#define SDHC_ACESR_ACMDCRC_YES                (SDHC_ACESR_ACMDCRC_YES_Val << SDHC_ACESR_ACMDCRC_Pos) /* (SDHC_ACESR) CRC Error Generated Position  */
#define SDHC_ACESR_ACMDEND_Pos                _UINT16_(3)                                          /* (SDHC_ACESR) Auto CMD End Bit Error Position */
#define SDHC_ACESR_ACMDEND_Msk                (_UINT16_(0x1) << SDHC_ACESR_ACMDEND_Pos)            /* (SDHC_ACESR) Auto CMD End Bit Error Mask */
#define SDHC_ACESR_ACMDEND(value)             (SDHC_ACESR_ACMDEND_Msk & (_UINT16_(value) << SDHC_ACESR_ACMDEND_Pos)) /* Assigment of value for ACMDEND in the SDHC_ACESR register */
#define   SDHC_ACESR_ACMDEND_NO_Val           _UINT16_(0x0)                                        /* (SDHC_ACESR) No error  */
#define   SDHC_ACESR_ACMDEND_YES_Val          _UINT16_(0x1)                                        /* (SDHC_ACESR) End Bit Error Generated  */
#define SDHC_ACESR_ACMDEND_NO                 (SDHC_ACESR_ACMDEND_NO_Val << SDHC_ACESR_ACMDEND_Pos) /* (SDHC_ACESR) No error Position  */
#define SDHC_ACESR_ACMDEND_YES                (SDHC_ACESR_ACMDEND_YES_Val << SDHC_ACESR_ACMDEND_Pos) /* (SDHC_ACESR) End Bit Error Generated Position  */
#define SDHC_ACESR_ACMDIDX_Pos                _UINT16_(4)                                          /* (SDHC_ACESR) Auto CMD Index Error Position */
#define SDHC_ACESR_ACMDIDX_Msk                (_UINT16_(0x1) << SDHC_ACESR_ACMDIDX_Pos)            /* (SDHC_ACESR) Auto CMD Index Error Mask */
#define SDHC_ACESR_ACMDIDX(value)             (SDHC_ACESR_ACMDIDX_Msk & (_UINT16_(value) << SDHC_ACESR_ACMDIDX_Pos)) /* Assigment of value for ACMDIDX in the SDHC_ACESR register */
#define   SDHC_ACESR_ACMDIDX_NO_Val           _UINT16_(0x0)                                        /* (SDHC_ACESR) No error  */
#define   SDHC_ACESR_ACMDIDX_YES_Val          _UINT16_(0x1)                                        /* (SDHC_ACESR) Error  */
#define SDHC_ACESR_ACMDIDX_NO                 (SDHC_ACESR_ACMDIDX_NO_Val << SDHC_ACESR_ACMDIDX_Pos) /* (SDHC_ACESR) No error Position  */
#define SDHC_ACESR_ACMDIDX_YES                (SDHC_ACESR_ACMDIDX_YES_Val << SDHC_ACESR_ACMDIDX_Pos) /* (SDHC_ACESR) Error Position  */
#define SDHC_ACESR_CMDNI_Pos                  _UINT16_(7)                                          /* (SDHC_ACESR) Command not Issued By Auto CMD12 Error Position */
#define SDHC_ACESR_CMDNI_Msk                  (_UINT16_(0x1) << SDHC_ACESR_CMDNI_Pos)              /* (SDHC_ACESR) Command not Issued By Auto CMD12 Error Mask */
#define SDHC_ACESR_CMDNI(value)               (SDHC_ACESR_CMDNI_Msk & (_UINT16_(value) << SDHC_ACESR_CMDNI_Pos)) /* Assigment of value for CMDNI in the SDHC_ACESR register */
#define   SDHC_ACESR_CMDNI_OK_Val             _UINT16_(0x0)                                        /* (SDHC_ACESR) No error  */
#define   SDHC_ACESR_CMDNI_NOT_ISSUED_Val     _UINT16_(0x1)                                        /* (SDHC_ACESR) Not Issued  */
#define SDHC_ACESR_CMDNI_OK                   (SDHC_ACESR_CMDNI_OK_Val << SDHC_ACESR_CMDNI_Pos)    /* (SDHC_ACESR) No error Position  */
#define SDHC_ACESR_CMDNI_NOT_ISSUED           (SDHC_ACESR_CMDNI_NOT_ISSUED_Val << SDHC_ACESR_CMDNI_Pos) /* (SDHC_ACESR) Not Issued Position  */
#define SDHC_ACESR_Msk                        _UINT16_(0x009F)                                     /* (SDHC_ACESR) Register Mask  */


/* -------- SDHC_ACR : (SDHC Offset: 0x208) (R/W 32) AHB Control -------- */
#define SDHC_ACR_RESETVALUE                   _UINT32_(0x00)                                       /*  (SDHC_ACR) AHB Control  Reset Value */

#define SDHC_ACR_BMAX_Pos                     _UINT32_(0)                                          /* (SDHC_ACR) AHB Maximum Burst Position */
#define SDHC_ACR_BMAX_Msk                     (_UINT32_(0x3) << SDHC_ACR_BMAX_Pos)                 /* (SDHC_ACR) AHB Maximum Burst Mask */
#define SDHC_ACR_BMAX(value)                  (SDHC_ACR_BMAX_Msk & (_UINT32_(value) << SDHC_ACR_BMAX_Pos)) /* Assigment of value for BMAX in the SDHC_ACR register */
#define   SDHC_ACR_BMAX_INCR16_Val            _UINT32_(0x0)                                        /* (SDHC_ACR)   */
#define   SDHC_ACR_BMAX_INCR8_Val             _UINT32_(0x1)                                        /* (SDHC_ACR)   */
#define   SDHC_ACR_BMAX_INCR4_Val             _UINT32_(0x2)                                        /* (SDHC_ACR)   */
#define   SDHC_ACR_BMAX_SINGLE_Val            _UINT32_(0x3)                                        /* (SDHC_ACR)   */
#define SDHC_ACR_BMAX_INCR16                  (SDHC_ACR_BMAX_INCR16_Val << SDHC_ACR_BMAX_Pos)      /* (SDHC_ACR)  Position  */
#define SDHC_ACR_BMAX_INCR8                   (SDHC_ACR_BMAX_INCR8_Val << SDHC_ACR_BMAX_Pos)       /* (SDHC_ACR)  Position  */
#define SDHC_ACR_BMAX_INCR4                   (SDHC_ACR_BMAX_INCR4_Val << SDHC_ACR_BMAX_Pos)       /* (SDHC_ACR)  Position  */
#define SDHC_ACR_BMAX_SINGLE                  (SDHC_ACR_BMAX_SINGLE_Val << SDHC_ACR_BMAX_Pos)      /* (SDHC_ACR)  Position  */
#define SDHC_ACR_Msk                          _UINT32_(0x00000003)                                 /* (SDHC_ACR) Register Mask  */


/* -------- SDHC_AESR : (SDHC Offset: 0x54) ( R/ 8) ADMA Error Status -------- */
#define SDHC_AESR_RESETVALUE                  _UINT8_(0x00)                                        /*  (SDHC_AESR) ADMA Error Status  Reset Value */

#define SDHC_AESR_ERRST_Pos                   _UINT8_(0)                                           /* (SDHC_AESR) ADMA Error State Position */
#define SDHC_AESR_ERRST_Msk                   (_UINT8_(0x3) << SDHC_AESR_ERRST_Pos)                /* (SDHC_AESR) ADMA Error State Mask */
#define SDHC_AESR_ERRST(value)                (SDHC_AESR_ERRST_Msk & (_UINT8_(value) << SDHC_AESR_ERRST_Pos)) /* Assigment of value for ERRST in the SDHC_AESR register */
#define   SDHC_AESR_ERRST_STOP_Val            _UINT8_(0x0)                                         /* (SDHC_AESR) ST_STOP (Stop DMA)  */
#define   SDHC_AESR_ERRST_FDS_Val             _UINT8_(0x1)                                         /* (SDHC_AESR) ST_FDS (Fetch Descriptor)  */
#define   SDHC_AESR_ERRST_TFR_Val             _UINT8_(0x3)                                         /* (SDHC_AESR) ST_TFR (Transfer Data)  */
#define SDHC_AESR_ERRST_STOP                  (SDHC_AESR_ERRST_STOP_Val << SDHC_AESR_ERRST_Pos)    /* (SDHC_AESR) ST_STOP (Stop DMA) Position  */
#define SDHC_AESR_ERRST_FDS                   (SDHC_AESR_ERRST_FDS_Val << SDHC_AESR_ERRST_Pos)     /* (SDHC_AESR) ST_FDS (Fetch Descriptor) Position  */
#define SDHC_AESR_ERRST_TFR                   (SDHC_AESR_ERRST_TFR_Val << SDHC_AESR_ERRST_Pos)     /* (SDHC_AESR) ST_TFR (Transfer Data) Position  */
#define SDHC_AESR_LMIS_Pos                    _UINT8_(2)                                           /* (SDHC_AESR) ADMA Length Mismatch Error Position */
#define SDHC_AESR_LMIS_Msk                    (_UINT8_(0x1) << SDHC_AESR_LMIS_Pos)                 /* (SDHC_AESR) ADMA Length Mismatch Error Mask */
#define SDHC_AESR_LMIS(value)                 (SDHC_AESR_LMIS_Msk & (_UINT8_(value) << SDHC_AESR_LMIS_Pos)) /* Assigment of value for LMIS in the SDHC_AESR register */
#define   SDHC_AESR_LMIS_NO_Val               _UINT8_(0x0)                                         /* (SDHC_AESR) No Error  */
#define   SDHC_AESR_LMIS_YES_Val              _UINT8_(0x1)                                         /* (SDHC_AESR) Error  */
#define SDHC_AESR_LMIS_NO                     (SDHC_AESR_LMIS_NO_Val << SDHC_AESR_LMIS_Pos)        /* (SDHC_AESR) No Error Position  */
#define SDHC_AESR_LMIS_YES                    (SDHC_AESR_LMIS_YES_Val << SDHC_AESR_LMIS_Pos)       /* (SDHC_AESR) Error Position  */
#define SDHC_AESR_Msk                         _UINT8_(0x07)                                        /* (SDHC_AESR) Register Mask  */


