Microchip-MPLAB-Harmony/reference_apps/apps/pic32cx_sg61_cult/pic32cx_sg61_getting_started/firmware/src/packs/PIC32CX1025SG61128_DFP/component/sdhc.h
/* -------- SDHC_APSR : (SDHC Offset: 0x200) ( R/ 32) Additional Present State Register -------- */
#define SDHC_APSR_RESETVALUE                  _UINT32_(0x0F)                                       /*  (SDHC_APSR) Additional Present State Register  Reset Value */

#define SDHC_APSR_HDATLL_Pos                  _UINT32_(0)                                          /* (SDHC_APSR) High Line Level Position */
#define SDHC_APSR_HDATLL_Msk                  (_UINT32_(0xF) << SDHC_APSR_HDATLL_Pos)              /* (SDHC_APSR) High Line Level Mask */
#define SDHC_APSR_HDATLL(value)               (SDHC_APSR_HDATLL_Msk & (_UINT32_(value) << SDHC_APSR_HDATLL_Pos)) /* Assigment of value for HDATLL in the SDHC_APSR register */
#define SDHC_APSR_Msk                         _UINT32_(0x0000000F)                                 /* (SDHC_APSR) Register Mask  */


/* -------- SDHC_ARG1R : (SDHC Offset: 0x08) (R/W 32) Argument 1 -------- */
#define SDHC_ARG1R_RESETVALUE                 _UINT32_(0x00)                                       /*  (SDHC_ARG1R) Argument 1  Reset Value */

#define SDHC_ARG1R_ARG_Pos                    _UINT32_(0)                                          /* (SDHC_ARG1R) Argument 1 Position */
#define SDHC_ARG1R_ARG_Msk                    (_UINT32_(0xFFFFFFFF) << SDHC_ARG1R_ARG_Pos)         /* (SDHC_ARG1R) Argument 1 Mask */
#define SDHC_ARG1R_ARG(value)                 (SDHC_ARG1R_ARG_Msk & (_UINT32_(value) << SDHC_ARG1R_ARG_Pos)) /* Assigment of value for ARG in the SDHC_ARG1R register */
#define SDHC_ARG1R_Msk                        _UINT32_(0xFFFFFFFF)                                 /* (SDHC_ARG1R) Register Mask  */


/* -------- SDHC_ASAR : (SDHC Offset: 0x58) (R/W 32) ADMA System Address -------- */
#define SDHC_ASAR_RESETVALUE                  _UINT32_(0x00)                                       /*  (SDHC_ASAR) ADMA System Address  Reset Value */

#define SDHC_ASAR_ADMASA_Pos                  _UINT32_(0)                                          /* (SDHC_ASAR) ADMA System Address Position */
#define SDHC_ASAR_ADMASA_Msk                  (_UINT32_(0xFFFFFFFF) << SDHC_ASAR_ADMASA_Pos)       /* (SDHC_ASAR) ADMA System Address Mask */
#define SDHC_ASAR_ADMASA(value)               (SDHC_ASAR_ADMASA_Msk & (_UINT32_(value) << SDHC_ASAR_ADMASA_Pos)) /* Assigment of value for ADMASA in the SDHC_ASAR register */
#define SDHC_ASAR_Msk                         _UINT32_(0xFFFFFFFF)                                 /* (SDHC_ASAR) Register Mask  */


/* -------- SDHC_BCR : (SDHC Offset: 0x06) (R/W 16) Block Count -------- */
#define SDHC_BCR_RESETVALUE                   _UINT16_(0x00)                                       /*  (SDHC_BCR) Block Count  Reset Value */

#define SDHC_BCR_BCNT_Pos                     _UINT16_(0)                                          /* (SDHC_BCR) Blocks Count for Current Transfer Position */
#define SDHC_BCR_BCNT_Msk                     (_UINT16_(0xFFFF) << SDHC_BCR_BCNT_Pos)              /* (SDHC_BCR) Blocks Count for Current Transfer Mask */
#define SDHC_BCR_BCNT(value)                  (SDHC_BCR_BCNT_Msk & (_UINT16_(value) << SDHC_BCR_BCNT_Pos)) /* Assigment of value for BCNT in the SDHC_BCR register */
#define SDHC_BCR_Msk                          _UINT16_(0xFFFF)                                     /* (SDHC_BCR) Register Mask  */


/* -------- SDHC_BDPR : (SDHC Offset: 0x20) (R/W 32) Buffer Data Port -------- */
#define SDHC_BDPR_RESETVALUE                  _UINT32_(0x00)                                       /*  (SDHC_BDPR) Buffer Data Port  Reset Value */

#define SDHC_BDPR_BUFDATA_Pos                 _UINT32_(0)                                          /* (SDHC_BDPR) Buffer Data Position */
#define SDHC_BDPR_BUFDATA_Msk                 (_UINT32_(0xFFFFFFFF) << SDHC_BDPR_BUFDATA_Pos)      /* (SDHC_BDPR) Buffer Data Mask */
#define SDHC_BDPR_BUFDATA(value)              (SDHC_BDPR_BUFDATA_Msk & (_UINT32_(value) << SDHC_BDPR_BUFDATA_Pos)) /* Assigment of value for BUFDATA in the SDHC_BDPR register */
#define SDHC_BDPR_Msk                         _UINT32_(0xFFFFFFFF)                                 /* (SDHC_BDPR) Register Mask  */


/* -------- SDHC_BGCR : (SDHC Offset: 0x2A) (R/W 8) Block Gap Control -------- */
#define SDHC_BGCR_RESETVALUE                  _UINT8_(0x00)                                        /*  (SDHC_BGCR) Block Gap Control  Reset Value */

#define SDHC_BGCR_STPBGR_Pos                  _UINT8_(0)                                           /* (SDHC_BGCR) Stop at Block Gap Request Position */
#define SDHC_BGCR_STPBGR_Msk                  (_UINT8_(0x1) << SDHC_BGCR_STPBGR_Pos)               /* (SDHC_BGCR) Stop at Block Gap Request Mask */
#define SDHC_BGCR_STPBGR(value)               (SDHC_BGCR_STPBGR_Msk & (_UINT8_(value) << SDHC_BGCR_STPBGR_Pos)) /* Assigment of value for STPBGR in the SDHC_BGCR register */
#define   SDHC_BGCR_STPBGR_TRANSFER_Val       _UINT8_(0x0)                                         /* (SDHC_BGCR) Transfer  */
#define   SDHC_BGCR_STPBGR_STOP_Val           _UINT8_(0x1)                                         /* (SDHC_BGCR) Stop  */
#define SDHC_BGCR_STPBGR_TRANSFER             (SDHC_BGCR_STPBGR_TRANSFER_Val << SDHC_BGCR_STPBGR_Pos) /* (SDHC_BGCR) Transfer Position  */
#define SDHC_BGCR_STPBGR_STOP                 (SDHC_BGCR_STPBGR_STOP_Val << SDHC_BGCR_STPBGR_Pos)  /* (SDHC_BGCR) Stop Position  */
#define SDHC_BGCR_CONTR_Pos                   _UINT8_(1)                                           /* (SDHC_BGCR) Continue Request Position */
#define SDHC_BGCR_CONTR_Msk                   (_UINT8_(0x1) << SDHC_BGCR_CONTR_Pos)                /* (SDHC_BGCR) Continue Request Mask */
#define SDHC_BGCR_CONTR(value)                (SDHC_BGCR_CONTR_Msk & (_UINT8_(value) << SDHC_BGCR_CONTR_Pos)) /* Assigment of value for CONTR in the SDHC_BGCR register */
#define   SDHC_BGCR_CONTR_GO_ON_Val           _UINT8_(0x0)                                         /* (SDHC_BGCR) Not affected  */
#define   SDHC_BGCR_CONTR_RESTART_Val         _UINT8_(0x1)                                         /* (SDHC_BGCR) Restart  */
#define SDHC_BGCR_CONTR_GO_ON                 (SDHC_BGCR_CONTR_GO_ON_Val << SDHC_BGCR_CONTR_Pos)   /* (SDHC_BGCR) Not affected Position  */
#define SDHC_BGCR_CONTR_RESTART               (SDHC_BGCR_CONTR_RESTART_Val << SDHC_BGCR_CONTR_Pos) /* (SDHC_BGCR) Restart Position  */
#define SDHC_BGCR_RWCTRL_Pos                  _UINT8_(2)                                           /* (SDHC_BGCR) Read Wait Control Position */
#define SDHC_BGCR_RWCTRL_Msk                  (_UINT8_(0x1) << SDHC_BGCR_RWCTRL_Pos)               /* (SDHC_BGCR) Read Wait Control Mask */
#define SDHC_BGCR_RWCTRL(value)               (SDHC_BGCR_RWCTRL_Msk & (_UINT8_(value) << SDHC_BGCR_RWCTRL_Pos)) /* Assigment of value for RWCTRL in the SDHC_BGCR register */
#define   SDHC_BGCR_RWCTRL_DISABLE_Val        _UINT8_(0x0)                                         /* (SDHC_BGCR) Disable Read Wait Control  */
#define   SDHC_BGCR_RWCTRL_ENABLE_Val         _UINT8_(0x1)                                         /* (SDHC_BGCR) Enable Read Wait Control  */
#define SDHC_BGCR_RWCTRL_DISABLE              (SDHC_BGCR_RWCTRL_DISABLE_Val << SDHC_BGCR_RWCTRL_Pos) /* (SDHC_BGCR) Disable Read Wait Control Position  */
#define SDHC_BGCR_RWCTRL_ENABLE               (SDHC_BGCR_RWCTRL_ENABLE_Val << SDHC_BGCR_RWCTRL_Pos) /* (SDHC_BGCR) Enable Read Wait Control Position  */
#define SDHC_BGCR_INTBG_Pos                   _UINT8_(3)                                           /* (SDHC_BGCR) Interrupt at Block Gap Position */
#define SDHC_BGCR_INTBG_Msk                   (_UINT8_(0x1) << SDHC_BGCR_INTBG_Pos)                /* (SDHC_BGCR) Interrupt at Block Gap Mask */
#define SDHC_BGCR_INTBG(value)                (SDHC_BGCR_INTBG_Msk & (_UINT8_(value) << SDHC_BGCR_INTBG_Pos)) /* Assigment of value for INTBG in the SDHC_BGCR register */
#define   SDHC_BGCR_INTBG_DISABLED_Val        _UINT8_(0x0)                                         /* (SDHC_BGCR) Disabled  */
#define   SDHC_BGCR_INTBG_ENABLED_Val         _UINT8_(0x1)                                         /* (SDHC_BGCR) Enabled  */
#define SDHC_BGCR_INTBG_DISABLED              (SDHC_BGCR_INTBG_DISABLED_Val << SDHC_BGCR_INTBG_Pos) /* (SDHC_BGCR) Disabled Position  */
#define SDHC_BGCR_INTBG_ENABLED               (SDHC_BGCR_INTBG_ENABLED_Val << SDHC_BGCR_INTBG_Pos) /* (SDHC_BGCR) Enabled Position  */
#define SDHC_BGCR_Msk                         _UINT8_(0x0F)                                        /* (SDHC_BGCR) Register Mask  */

/* EMMC mode */
#define SDHC_BGCR_EMMC_Msk                    _UINT8_(0x00)                                         /* (SDHC_BGCR_EMMC) Register Mask  */


/* -------- SDHC_BSR : (SDHC Offset: 0x04) (R/W 16) Block Size -------- */
#define SDHC_BSR_RESETVALUE                   _UINT16_(0x00)                                       /*  (SDHC_BSR) Block Size  Reset Value */

#define SDHC_BSR_BLOCKSIZE_Pos                _UINT16_(0)                                          /* (SDHC_BSR) Transfer Block Size Position */
#define SDHC_BSR_BLOCKSIZE_Msk                (_UINT16_(0x3FF) << SDHC_BSR_BLOCKSIZE_Pos)          /* (SDHC_BSR) Transfer Block Size Mask */
#define SDHC_BSR_BLOCKSIZE(value)             (SDHC_BSR_BLOCKSIZE_Msk & (_UINT16_(value) << SDHC_BSR_BLOCKSIZE_Pos)) /* Assigment of value for BLOCKSIZE in the SDHC_BSR register */
#define SDHC_BSR_BOUNDARY_Pos                 _UINT16_(12)                                         /* (SDHC_BSR) SDMA Buffer Boundary Position */
#define SDHC_BSR_BOUNDARY_Msk                 (_UINT16_(0x7) << SDHC_BSR_BOUNDARY_Pos)             /* (SDHC_BSR) SDMA Buffer Boundary Mask */
#define SDHC_BSR_BOUNDARY(value)              (SDHC_BSR_BOUNDARY_Msk & (_UINT16_(value) << SDHC_BSR_BOUNDARY_Pos)) /* Assigment of value for BOUNDARY in the SDHC_BSR register */
#define   SDHC_BSR_BOUNDARY_4K_Val            _UINT16_(0x0)                                        /* (SDHC_BSR) 4k bytes  */
#define   SDHC_BSR_BOUNDARY_8K_Val            _UINT16_(0x1)                                        /* (SDHC_BSR) 8k bytes  */
#define   SDHC_BSR_BOUNDARY_16K_Val           _UINT16_(0x2)                                        /* (SDHC_BSR) 16k bytes  */
#define   SDHC_BSR_BOUNDARY_32K_Val           _UINT16_(0x3)                                        /* (SDHC_BSR) 32k bytes  */
#define   SDHC_BSR_BOUNDARY_64K_Val           _UINT16_(0x4)                                        /* (SDHC_BSR) 64k bytes  */
#define   SDHC_BSR_BOUNDARY_128K_Val          _UINT16_(0x5)                                        /* (SDHC_BSR) 128k bytes  */
#define   SDHC_BSR_BOUNDARY_256K_Val          _UINT16_(0x6)                                        /* (SDHC_BSR) 256k bytes  */
#define   SDHC_BSR_BOUNDARY_512K_Val          _UINT16_(0x7)                                        /* (SDHC_BSR) 512k bytes  */
#define SDHC_BSR_BOUNDARY_4K                  (SDHC_BSR_BOUNDARY_4K_Val << SDHC_BSR_BOUNDARY_Pos)  /* (SDHC_BSR) 4k bytes Position  */
#define SDHC_BSR_BOUNDARY_8K                  (SDHC_BSR_BOUNDARY_8K_Val << SDHC_BSR_BOUNDARY_Pos)  /* (SDHC_BSR) 8k bytes Position  */
#define SDHC_BSR_BOUNDARY_16K                 (SDHC_BSR_BOUNDARY_16K_Val << SDHC_BSR_BOUNDARY_Pos) /* (SDHC_BSR) 16k bytes Position  */
#define SDHC_BSR_BOUNDARY_32K                 (SDHC_BSR_BOUNDARY_32K_Val << SDHC_BSR_BOUNDARY_Pos) /* (SDHC_BSR) 32k bytes Position  */
#define SDHC_BSR_BOUNDARY_64K                 (SDHC_BSR_BOUNDARY_64K_Val << SDHC_BSR_BOUNDARY_Pos) /* (SDHC_BSR) 64k bytes Position  */
#define SDHC_BSR_BOUNDARY_128K                (SDHC_BSR_BOUNDARY_128K_Val << SDHC_BSR_BOUNDARY_Pos) /* (SDHC_BSR) 128k bytes Position  */
#define SDHC_BSR_BOUNDARY_256K                (SDHC_BSR_BOUNDARY_256K_Val << SDHC_BSR_BOUNDARY_Pos) /* (SDHC_BSR) 256k bytes Position  */
#define SDHC_BSR_BOUNDARY_512K                (SDHC_BSR_BOUNDARY_512K_Val << SDHC_BSR_BOUNDARY_Pos) /* (SDHC_BSR) 512k bytes Position  */
#define SDHC_BSR_Msk                          _UINT16_(0x73FF)                                     /* (SDHC_BSR) Register Mask  */


/* -------- SDHC_CA0R : (SDHC Offset: 0x40) ( R/ 32) Capabilities 0 -------- */
#define SDHC_CA0R_RESETVALUE                  _UINT32_(0x27E80080)                                 /*  (SDHC_CA0R) Capabilities 0  Reset Value */

