Microchip-MPLAB-Harmony/reference_apps/apps/pic32cx_sg61_cult/pic32cx_sg61_getting_started/firmware/src/packs/PIC32CX1025SG61128_DFP/component/sdhc.h
/* -------- SDHC_CACR : (SDHC Offset: 0x230) (R/W 32) Capabilities Control -------- */
#define SDHC_CACR_RESETVALUE                  _UINT32_(0x00)                                       /*  (SDHC_CACR) Capabilities Control  Reset Value */

#define SDHC_CACR_CAPWREN_Pos                 _UINT32_(0)                                          /* (SDHC_CACR) Capabilities Registers Write Enable (Required to write the correct frequencies in the Capabilities Registers) Position */
#define SDHC_CACR_CAPWREN_Msk                 (_UINT32_(0x1) << SDHC_CACR_CAPWREN_Pos)             /* (SDHC_CACR) Capabilities Registers Write Enable (Required to write the correct frequencies in the Capabilities Registers) Mask */
#define SDHC_CACR_CAPWREN(value)              (SDHC_CACR_CAPWREN_Msk & (_UINT32_(value) << SDHC_CACR_CAPWREN_Pos)) /* Assigment of value for CAPWREN in the SDHC_CACR register */
#define SDHC_CACR_KEY_Pos                     _UINT32_(8)                                          /* (SDHC_CACR) Key (0x46) Position */
#define SDHC_CACR_KEY_Msk                     (_UINT32_(0xFF) << SDHC_CACR_KEY_Pos)                /* (SDHC_CACR) Key (0x46) Mask */
#define SDHC_CACR_KEY(value)                  (SDHC_CACR_KEY_Msk & (_UINT32_(value) << SDHC_CACR_KEY_Pos)) /* Assigment of value for KEY in the SDHC_CACR register */
#define   SDHC_CACR_KEY_KEY_Val               _UINT32_(0x46)                                       /* (SDHC_CACR) Key  */
#define SDHC_CACR_KEY_KEY                     (SDHC_CACR_KEY_KEY_Val << SDHC_CACR_KEY_Pos)         /* (SDHC_CACR) Key Position  */
#define SDHC_CACR_Msk                         _UINT32_(0x0000FF01)                                 /* (SDHC_CACR) Register Mask  */


/* -------- SDHC_CC2R : (SDHC Offset: 0x20C) (R/W 32) Clock Control 2 -------- */
#define SDHC_CC2R_RESETVALUE                  _UINT32_(0x00)                                       /*  (SDHC_CC2R) Clock Control 2  Reset Value */

#define SDHC_CC2R_FSDCLKD_Pos                 _UINT32_(0)                                          /* (SDHC_CC2R) Force SDCK Disabled Position */
#define SDHC_CC2R_FSDCLKD_Msk                 (_UINT32_(0x1) << SDHC_CC2R_FSDCLKD_Pos)             /* (SDHC_CC2R) Force SDCK Disabled Mask */
#define SDHC_CC2R_FSDCLKD(value)              (SDHC_CC2R_FSDCLKD_Msk & (_UINT32_(value) << SDHC_CC2R_FSDCLKD_Pos)) /* Assigment of value for FSDCLKD in the SDHC_CC2R register */
#define   SDHC_CC2R_FSDCLKD_NOEFFECT_Val      _UINT32_(0x0)                                        /* (SDHC_CC2R) No effect  */
#define   SDHC_CC2R_FSDCLKD_DISABLE_Val       _UINT32_(0x1)                                        /* (SDHC_CC2R) SDCLK can be stopped at any time after DATA transfer.SDCLK enable forcing for 8 SDCLK cycles is disabled  */
#define SDHC_CC2R_FSDCLKD_NOEFFECT            (SDHC_CC2R_FSDCLKD_NOEFFECT_Val << SDHC_CC2R_FSDCLKD_Pos) /* (SDHC_CC2R) No effect Position  */
#define SDHC_CC2R_FSDCLKD_DISABLE             (SDHC_CC2R_FSDCLKD_DISABLE_Val << SDHC_CC2R_FSDCLKD_Pos) /* (SDHC_CC2R) SDCLK can be stopped at any time after DATA transfer.SDCLK enable forcing for 8 SDCLK cycles is disabled Position  */
#define SDHC_CC2R_Msk                         _UINT32_(0x00000001)                                 /* (SDHC_CC2R) Register Mask  */


/* -------- SDHC_CCR : (SDHC Offset: 0x2C) (R/W 16) Clock Control -------- */
#define SDHC_CCR_RESETVALUE                   _UINT16_(0x00)                                       /*  (SDHC_CCR) Clock Control  Reset Value */

#define SDHC_CCR_INTCLKEN_Pos                 _UINT16_(0)                                          /* (SDHC_CCR) Internal Clock Enable Position */
#define SDHC_CCR_INTCLKEN_Msk                 (_UINT16_(0x1) << SDHC_CCR_INTCLKEN_Pos)             /* (SDHC_CCR) Internal Clock Enable Mask */
#define SDHC_CCR_INTCLKEN(value)              (SDHC_CCR_INTCLKEN_Msk & (_UINT16_(value) << SDHC_CCR_INTCLKEN_Pos)) /* Assigment of value for INTCLKEN in the SDHC_CCR register */
#define   SDHC_CCR_INTCLKEN_OFF_Val           _UINT16_(0x0)                                        /* (SDHC_CCR) Stop  */
#define   SDHC_CCR_INTCLKEN_ON_Val            _UINT16_(0x1)                                        /* (SDHC_CCR) Oscillate  */
#define SDHC_CCR_INTCLKEN_OFF                 (SDHC_CCR_INTCLKEN_OFF_Val << SDHC_CCR_INTCLKEN_Pos) /* (SDHC_CCR) Stop Position  */
#define SDHC_CCR_INTCLKEN_ON                  (SDHC_CCR_INTCLKEN_ON_Val << SDHC_CCR_INTCLKEN_Pos)  /* (SDHC_CCR) Oscillate Position  */
#define SDHC_CCR_INTCLKS_Pos                  _UINT16_(1)                                          /* (SDHC_CCR) Internal Clock Stable Position */
#define SDHC_CCR_INTCLKS_Msk                  (_UINT16_(0x1) << SDHC_CCR_INTCLKS_Pos)              /* (SDHC_CCR) Internal Clock Stable Mask */
#define SDHC_CCR_INTCLKS(value)               (SDHC_CCR_INTCLKS_Msk & (_UINT16_(value) << SDHC_CCR_INTCLKS_Pos)) /* Assigment of value for INTCLKS in the SDHC_CCR register */
#define   SDHC_CCR_INTCLKS_NOT_READY_Val      _UINT16_(0x0)                                        /* (SDHC_CCR) Not Ready  */
#define   SDHC_CCR_INTCLKS_READY_Val          _UINT16_(0x1)                                        /* (SDHC_CCR) Ready  */
#define SDHC_CCR_INTCLKS_NOT_READY            (SDHC_CCR_INTCLKS_NOT_READY_Val << SDHC_CCR_INTCLKS_Pos) /* (SDHC_CCR) Not Ready Position  */
#define SDHC_CCR_INTCLKS_READY                (SDHC_CCR_INTCLKS_READY_Val << SDHC_CCR_INTCLKS_Pos) /* (SDHC_CCR) Ready Position  */
#define SDHC_CCR_SDCLKEN_Pos                  _UINT16_(2)                                          /* (SDHC_CCR) SD Clock Enable Position */
#define SDHC_CCR_SDCLKEN_Msk                  (_UINT16_(0x1) << SDHC_CCR_SDCLKEN_Pos)              /* (SDHC_CCR) SD Clock Enable Mask */
#define SDHC_CCR_SDCLKEN(value)               (SDHC_CCR_SDCLKEN_Msk & (_UINT16_(value) << SDHC_CCR_SDCLKEN_Pos)) /* Assigment of value for SDCLKEN in the SDHC_CCR register */
#define   SDHC_CCR_SDCLKEN_DISABLE_Val        _UINT16_(0x0)                                        /* (SDHC_CCR) Disable  */
#define   SDHC_CCR_SDCLKEN_ENABLE_Val         _UINT16_(0x1)                                        /* (SDHC_CCR) Enable  */
#define SDHC_CCR_SDCLKEN_DISABLE              (SDHC_CCR_SDCLKEN_DISABLE_Val << SDHC_CCR_SDCLKEN_Pos) /* (SDHC_CCR) Disable Position  */
#define SDHC_CCR_SDCLKEN_ENABLE               (SDHC_CCR_SDCLKEN_ENABLE_Val << SDHC_CCR_SDCLKEN_Pos) /* (SDHC_CCR) Enable Position  */
#define SDHC_CCR_CLKGSEL_Pos                  _UINT16_(5)                                          /* (SDHC_CCR) Clock Generator Select Position */
#define SDHC_CCR_CLKGSEL_Msk                  (_UINT16_(0x1) << SDHC_CCR_CLKGSEL_Pos)              /* (SDHC_CCR) Clock Generator Select Mask */
#define SDHC_CCR_CLKGSEL(value)               (SDHC_CCR_CLKGSEL_Msk & (_UINT16_(value) << SDHC_CCR_CLKGSEL_Pos)) /* Assigment of value for CLKGSEL in the SDHC_CCR register */
#define   SDHC_CCR_CLKGSEL_DIV_Val            _UINT16_(0x0)                                        /* (SDHC_CCR) Divided Clock Mode  */
#define   SDHC_CCR_CLKGSEL_PROG_Val           _UINT16_(0x1)                                        /* (SDHC_CCR) Programmable Clock Mode  */
#define SDHC_CCR_CLKGSEL_DIV                  (SDHC_CCR_CLKGSEL_DIV_Val << SDHC_CCR_CLKGSEL_Pos)   /* (SDHC_CCR) Divided Clock Mode Position  */
#define SDHC_CCR_CLKGSEL_PROG                 (SDHC_CCR_CLKGSEL_PROG_Val << SDHC_CCR_CLKGSEL_Pos)  /* (SDHC_CCR) Programmable Clock Mode Position  */
#define SDHC_CCR_USDCLKFSEL_Pos               _UINT16_(6)                                          /* (SDHC_CCR) Upper Bits of SDCLK Frequency Select Position */
#define SDHC_CCR_USDCLKFSEL_Msk               (_UINT16_(0x3) << SDHC_CCR_USDCLKFSEL_Pos)           /* (SDHC_CCR) Upper Bits of SDCLK Frequency Select Mask */
#define SDHC_CCR_USDCLKFSEL(value)            (SDHC_CCR_USDCLKFSEL_Msk & (_UINT16_(value) << SDHC_CCR_USDCLKFSEL_Pos)) /* Assigment of value for USDCLKFSEL in the SDHC_CCR register */
#define SDHC_CCR_SDCLKFSEL_Pos                _UINT16_(8)                                          /* (SDHC_CCR) SDCLK Frequency Select Position */
#define SDHC_CCR_SDCLKFSEL_Msk                (_UINT16_(0xFF) << SDHC_CCR_SDCLKFSEL_Pos)           /* (SDHC_CCR) SDCLK Frequency Select Mask */
#define SDHC_CCR_SDCLKFSEL(value)             (SDHC_CCR_SDCLKFSEL_Msk & (_UINT16_(value) << SDHC_CCR_SDCLKFSEL_Pos)) /* Assigment of value for SDCLKFSEL in the SDHC_CCR register */
#define SDHC_CCR_Msk                          _UINT16_(0xFFE7)                                     /* (SDHC_CCR) Register Mask  */


