Microchip-MPLAB-Harmony/reference_apps/apps/pic32cx_sg61_cult/pic32cx_sg61_getting_started/firmware/src/packs/PIC32CX1025SG61128_DFP/component/sdhc.h
/* -------- SDHC_CR : (SDHC Offset: 0x0E) (R/W 16) Command -------- */
#define SDHC_CR_RESETVALUE                    _UINT16_(0x00)                                       /*  (SDHC_CR) Command  Reset Value */

#define SDHC_CR_RESPTYP_Pos                   _UINT16_(0)                                          /* (SDHC_CR) Response Type Position */
#define SDHC_CR_RESPTYP_Msk                   (_UINT16_(0x3) << SDHC_CR_RESPTYP_Pos)               /* (SDHC_CR) Response Type Mask */
#define SDHC_CR_RESPTYP(value)                (SDHC_CR_RESPTYP_Msk & (_UINT16_(value) << SDHC_CR_RESPTYP_Pos)) /* Assigment of value for RESPTYP in the SDHC_CR register */
#define   SDHC_CR_RESPTYP_NONE_Val            _UINT16_(0x0)                                        /* (SDHC_CR) No response  */
#define   SDHC_CR_RESPTYP_136_BIT_Val         _UINT16_(0x1)                                        /* (SDHC_CR) 136-bit response  */
#define   SDHC_CR_RESPTYP_48_BIT_Val          _UINT16_(0x2)                                        /* (SDHC_CR) 48-bit response  */
#define   SDHC_CR_RESPTYP_48_BIT_BUSY_Val     _UINT16_(0x3)                                        /* (SDHC_CR) 48-bit response check busy after response  */
#define SDHC_CR_RESPTYP_NONE                  (SDHC_CR_RESPTYP_NONE_Val << SDHC_CR_RESPTYP_Pos)    /* (SDHC_CR) No response Position  */
#define SDHC_CR_RESPTYP_136_BIT               (SDHC_CR_RESPTYP_136_BIT_Val << SDHC_CR_RESPTYP_Pos) /* (SDHC_CR) 136-bit response Position  */
#define SDHC_CR_RESPTYP_48_BIT                (SDHC_CR_RESPTYP_48_BIT_Val << SDHC_CR_RESPTYP_Pos)  /* (SDHC_CR) 48-bit response Position  */
#define SDHC_CR_RESPTYP_48_BIT_BUSY           (SDHC_CR_RESPTYP_48_BIT_BUSY_Val << SDHC_CR_RESPTYP_Pos) /* (SDHC_CR) 48-bit response check busy after response Position  */
#define SDHC_CR_CMDCCEN_Pos                   _UINT16_(3)                                          /* (SDHC_CR) Command CRC Check Enable Position */
#define SDHC_CR_CMDCCEN_Msk                   (_UINT16_(0x1) << SDHC_CR_CMDCCEN_Pos)               /* (SDHC_CR) Command CRC Check Enable Mask */
#define SDHC_CR_CMDCCEN(value)                (SDHC_CR_CMDCCEN_Msk & (_UINT16_(value) << SDHC_CR_CMDCCEN_Pos)) /* Assigment of value for CMDCCEN in the SDHC_CR register */
#define   SDHC_CR_CMDCCEN_DISABLE_Val         _UINT16_(0x0)                                        /* (SDHC_CR) Disable  */
#define   SDHC_CR_CMDCCEN_ENABLE_Val          _UINT16_(0x1)                                        /* (SDHC_CR) Enable  */
#define SDHC_CR_CMDCCEN_DISABLE               (SDHC_CR_CMDCCEN_DISABLE_Val << SDHC_CR_CMDCCEN_Pos) /* (SDHC_CR) Disable Position  */
#define SDHC_CR_CMDCCEN_ENABLE                (SDHC_CR_CMDCCEN_ENABLE_Val << SDHC_CR_CMDCCEN_Pos)  /* (SDHC_CR) Enable Position  */
#define SDHC_CR_CMDICEN_Pos                   _UINT16_(4)                                          /* (SDHC_CR) Command Index Check Enable Position */
#define SDHC_CR_CMDICEN_Msk                   (_UINT16_(0x1) << SDHC_CR_CMDICEN_Pos)               /* (SDHC_CR) Command Index Check Enable Mask */
#define SDHC_CR_CMDICEN(value)                (SDHC_CR_CMDICEN_Msk & (_UINT16_(value) << SDHC_CR_CMDICEN_Pos)) /* Assigment of value for CMDICEN in the SDHC_CR register */
#define   SDHC_CR_CMDICEN_DISABLE_Val         _UINT16_(0x0)                                        /* (SDHC_CR) Disable  */
#define   SDHC_CR_CMDICEN_ENABLE_Val          _UINT16_(0x1)                                        /* (SDHC_CR) Enable  */
#define SDHC_CR_CMDICEN_DISABLE               (SDHC_CR_CMDICEN_DISABLE_Val << SDHC_CR_CMDICEN_Pos) /* (SDHC_CR) Disable Position  */
#define SDHC_CR_CMDICEN_ENABLE                (SDHC_CR_CMDICEN_ENABLE_Val << SDHC_CR_CMDICEN_Pos)  /* (SDHC_CR) Enable Position  */
#define SDHC_CR_DPSEL_Pos                     _UINT16_(5)                                          /* (SDHC_CR) Data Present Select Position */
#define SDHC_CR_DPSEL_Msk                     (_UINT16_(0x1) << SDHC_CR_DPSEL_Pos)                 /* (SDHC_CR) Data Present Select Mask */
#define SDHC_CR_DPSEL(value)                  (SDHC_CR_DPSEL_Msk & (_UINT16_(value) << SDHC_CR_DPSEL_Pos)) /* Assigment of value for DPSEL in the SDHC_CR register */
#define   SDHC_CR_DPSEL_NO_DATA_Val           _UINT16_(0x0)                                        /* (SDHC_CR) No Data Present  */
#define   SDHC_CR_DPSEL_DATA_Val              _UINT16_(0x1)                                        /* (SDHC_CR) Data Present  */
#define SDHC_CR_DPSEL_NO_DATA                 (SDHC_CR_DPSEL_NO_DATA_Val << SDHC_CR_DPSEL_Pos)     /* (SDHC_CR) No Data Present Position  */
#define SDHC_CR_DPSEL_DATA                    (SDHC_CR_DPSEL_DATA_Val << SDHC_CR_DPSEL_Pos)        /* (SDHC_CR) Data Present Position  */
#define SDHC_CR_CMDTYP_Pos                    _UINT16_(6)                                          /* (SDHC_CR) Command Type Position */
#define SDHC_CR_CMDTYP_Msk                    (_UINT16_(0x3) << SDHC_CR_CMDTYP_Pos)                /* (SDHC_CR) Command Type Mask */
#define SDHC_CR_CMDTYP(value)                 (SDHC_CR_CMDTYP_Msk & (_UINT16_(value) << SDHC_CR_CMDTYP_Pos)) /* Assigment of value for CMDTYP in the SDHC_CR register */
#define   SDHC_CR_CMDTYP_NORMAL_Val           _UINT16_(0x0)                                        /* (SDHC_CR) Other commands  */
#define   SDHC_CR_CMDTYP_SUSPEND_Val          _UINT16_(0x1)                                        /* (SDHC_CR) CMD52 for writing Bus Suspend in CCCR  */
#define   SDHC_CR_CMDTYP_RESUME_Val           _UINT16_(0x2)                                        /* (SDHC_CR) CMD52 for writing Function Select in CCCR  */
#define   SDHC_CR_CMDTYP_ABORT_Val            _UINT16_(0x3)                                        /* (SDHC_CR) CMD12, CMD52 for writing I/O Abort in CCCR  */
#define SDHC_CR_CMDTYP_NORMAL                 (SDHC_CR_CMDTYP_NORMAL_Val << SDHC_CR_CMDTYP_Pos)    /* (SDHC_CR) Other commands Position  */
#define SDHC_CR_CMDTYP_SUSPEND                (SDHC_CR_CMDTYP_SUSPEND_Val << SDHC_CR_CMDTYP_Pos)   /* (SDHC_CR) CMD52 for writing Bus Suspend in CCCR Position  */
#define SDHC_CR_CMDTYP_RESUME                 (SDHC_CR_CMDTYP_RESUME_Val << SDHC_CR_CMDTYP_Pos)    /* (SDHC_CR) CMD52 for writing Function Select in CCCR Position  */
#define SDHC_CR_CMDTYP_ABORT                  (SDHC_CR_CMDTYP_ABORT_Val << SDHC_CR_CMDTYP_Pos)     /* (SDHC_CR) CMD12, CMD52 for writing I/O Abort in CCCR Position  */
#define SDHC_CR_CMDIDX_Pos                    _UINT16_(8)                                          /* (SDHC_CR) Command Index Position */
#define SDHC_CR_CMDIDX_Msk                    (_UINT16_(0x3F) << SDHC_CR_CMDIDX_Pos)               /* (SDHC_CR) Command Index Mask */
#define SDHC_CR_CMDIDX(value)                 (SDHC_CR_CMDIDX_Msk & (_UINT16_(value) << SDHC_CR_CMDIDX_Pos)) /* Assigment of value for CMDIDX in the SDHC_CR register */
#define SDHC_CR_Msk                           _UINT16_(0x3FFB)                                     /* (SDHC_CR) Register Mask  */


/* -------- SDHC_DBGR : (SDHC Offset: 0x234) (R/W 8) Debug -------- */
#define SDHC_DBGR_RESETVALUE                  _UINT8_(0x00)                                        /*  (SDHC_DBGR) Debug  Reset Value */

#define SDHC_DBGR_NIDBG_Pos                   _UINT8_(0)                                           /* (SDHC_DBGR) Non-intrusive debug enable Position */
#define SDHC_DBGR_NIDBG_Msk                   (_UINT8_(0x1) << SDHC_DBGR_NIDBG_Pos)                /* (SDHC_DBGR) Non-intrusive debug enable Mask */
#define SDHC_DBGR_NIDBG(value)                (SDHC_DBGR_NIDBG_Msk & (_UINT8_(value) << SDHC_DBGR_NIDBG_Pos)) /* Assigment of value for NIDBG in the SDHC_DBGR register */
#define   SDHC_DBGR_NIDBG_IDBG_Val            _UINT8_(0x0)                                         /* (SDHC_DBGR) Debugging is intrusive (reads of BDPR from debugger are considered and increment the internal buffer pointer)  */
#define   SDHC_DBGR_NIDBG_NIDBG_Val           _UINT8_(0x1)                                         /* (SDHC_DBGR) Debugging is not intrusive (reads of BDPR from debugger are discarded and do not increment the internal buffer pointer)  */
#define SDHC_DBGR_NIDBG_IDBG                  (SDHC_DBGR_NIDBG_IDBG_Val << SDHC_DBGR_NIDBG_Pos)    /* (SDHC_DBGR) Debugging is intrusive (reads of BDPR from debugger are considered and increment the internal buffer pointer) Position  */
#define SDHC_DBGR_NIDBG_NIDBG                 (SDHC_DBGR_NIDBG_NIDBG_Val << SDHC_DBGR_NIDBG_Pos)   /* (SDHC_DBGR) Debugging is not intrusive (reads of BDPR from debugger are discarded and do not increment the internal buffer pointer) Position  */
#define SDHC_DBGR_Msk                         _UINT8_(0x01)                                        /* (SDHC_DBGR) Register Mask  */


