Microchip-MPLAB-Harmony/reference_apps/apps/pic32cx_sg61_cult/pic32cx_sg61_getting_started/firmware/src/packs/PIC32CX1025SG61128_DFP/component/sdhc.h
#define SDHC_EISTER_CMDTEO_Pos                _UINT16_(0)                                          /* (SDHC_EISTER) Command Timeout Error Status Enable Position */
#define SDHC_EISTER_CMDTEO_Msk                (_UINT16_(0x1) << SDHC_EISTER_CMDTEO_Pos)            /* (SDHC_EISTER) Command Timeout Error Status Enable Mask */
#define SDHC_EISTER_CMDTEO(value)             (SDHC_EISTER_CMDTEO_Msk & (_UINT16_(value) << SDHC_EISTER_CMDTEO_Pos)) /* Assigment of value for CMDTEO in the SDHC_EISTER register */
#define   SDHC_EISTER_CMDTEO_MASKED_Val       _UINT16_(0x0)                                        /* (SDHC_EISTER) Masked  */
#define   SDHC_EISTER_CMDTEO_ENABLED_Val      _UINT16_(0x1)                                        /* (SDHC_EISTER) Enabled  */
#define SDHC_EISTER_CMDTEO_MASKED             (SDHC_EISTER_CMDTEO_MASKED_Val << SDHC_EISTER_CMDTEO_Pos) /* (SDHC_EISTER) Masked Position  */
#define SDHC_EISTER_CMDTEO_ENABLED            (SDHC_EISTER_CMDTEO_ENABLED_Val << SDHC_EISTER_CMDTEO_Pos) /* (SDHC_EISTER) Enabled Position  */
#define SDHC_EISTER_CMDCRC_Pos                _UINT16_(1)                                          /* (SDHC_EISTER) Command CRC Error Status Enable Position */
#define SDHC_EISTER_CMDCRC_Msk                (_UINT16_(0x1) << SDHC_EISTER_CMDCRC_Pos)            /* (SDHC_EISTER) Command CRC Error Status Enable Mask */
#define SDHC_EISTER_CMDCRC(value)             (SDHC_EISTER_CMDCRC_Msk & (_UINT16_(value) << SDHC_EISTER_CMDCRC_Pos)) /* Assigment of value for CMDCRC in the SDHC_EISTER register */
#define   SDHC_EISTER_CMDCRC_MASKED_Val       _UINT16_(0x0)                                        /* (SDHC_EISTER) Masked  */
#define   SDHC_EISTER_CMDCRC_ENABLED_Val      _UINT16_(0x1)                                        /* (SDHC_EISTER) Enabled  */
#define SDHC_EISTER_CMDCRC_MASKED             (SDHC_EISTER_CMDCRC_MASKED_Val << SDHC_EISTER_CMDCRC_Pos) /* (SDHC_EISTER) Masked Position  */
#define SDHC_EISTER_CMDCRC_ENABLED            (SDHC_EISTER_CMDCRC_ENABLED_Val << SDHC_EISTER_CMDCRC_Pos) /* (SDHC_EISTER) Enabled Position  */
#define SDHC_EISTER_CMDEND_Pos                _UINT16_(2)                                          /* (SDHC_EISTER) Command End Bit Error Status Enable Position */
#define SDHC_EISTER_CMDEND_Msk                (_UINT16_(0x1) << SDHC_EISTER_CMDEND_Pos)            /* (SDHC_EISTER) Command End Bit Error Status Enable Mask */
#define SDHC_EISTER_CMDEND(value)             (SDHC_EISTER_CMDEND_Msk & (_UINT16_(value) << SDHC_EISTER_CMDEND_Pos)) /* Assigment of value for CMDEND in the SDHC_EISTER register */
#define   SDHC_EISTER_CMDEND_MASKED_Val       _UINT16_(0x0)                                        /* (SDHC_EISTER) Masked  */
#define   SDHC_EISTER_CMDEND_ENABLED_Val      _UINT16_(0x1)                                        /* (SDHC_EISTER) Enabled  */
#define SDHC_EISTER_CMDEND_MASKED             (SDHC_EISTER_CMDEND_MASKED_Val << SDHC_EISTER_CMDEND_Pos) /* (SDHC_EISTER) Masked Position  */
#define SDHC_EISTER_CMDEND_ENABLED            (SDHC_EISTER_CMDEND_ENABLED_Val << SDHC_EISTER_CMDEND_Pos) /* (SDHC_EISTER) Enabled Position  */
#define SDHC_EISTER_CMDIDX_Pos                _UINT16_(3)                                          /* (SDHC_EISTER) Command Index Error Status Enable Position */
#define SDHC_EISTER_CMDIDX_Msk                (_UINT16_(0x1) << SDHC_EISTER_CMDIDX_Pos)            /* (SDHC_EISTER) Command Index Error Status Enable Mask */
#define SDHC_EISTER_CMDIDX(value)             (SDHC_EISTER_CMDIDX_Msk & (_UINT16_(value) << SDHC_EISTER_CMDIDX_Pos)) /* Assigment of value for CMDIDX in the SDHC_EISTER register */
#define   SDHC_EISTER_CMDIDX_MASKED_Val       _UINT16_(0x0)                                        /* (SDHC_EISTER) Masked  */
#define   SDHC_EISTER_CMDIDX_ENABLED_Val      _UINT16_(0x1)                                        /* (SDHC_EISTER) Enabled  */
#define SDHC_EISTER_CMDIDX_MASKED             (SDHC_EISTER_CMDIDX_MASKED_Val << SDHC_EISTER_CMDIDX_Pos) /* (SDHC_EISTER) Masked Position  */
#define SDHC_EISTER_CMDIDX_ENABLED            (SDHC_EISTER_CMDIDX_ENABLED_Val << SDHC_EISTER_CMDIDX_Pos) /* (SDHC_EISTER) Enabled Position  */
#define SDHC_EISTER_DATTEO_Pos                _UINT16_(4)                                          /* (SDHC_EISTER) Data Timeout Error Status Enable Position */
#define SDHC_EISTER_DATTEO_Msk                (_UINT16_(0x1) << SDHC_EISTER_DATTEO_Pos)            /* (SDHC_EISTER) Data Timeout Error Status Enable Mask */
#define SDHC_EISTER_DATTEO(value)             (SDHC_EISTER_DATTEO_Msk & (_UINT16_(value) << SDHC_EISTER_DATTEO_Pos)) /* Assigment of value for DATTEO in the SDHC_EISTER register */
#define   SDHC_EISTER_DATTEO_MASKED_Val       _UINT16_(0x0)                                        /* (SDHC_EISTER) Masked  */
#define   SDHC_EISTER_DATTEO_ENABLED_Val      _UINT16_(0x1)                                        /* (SDHC_EISTER) Enabled  */
#define SDHC_EISTER_DATTEO_MASKED             (SDHC_EISTER_DATTEO_MASKED_Val << SDHC_EISTER_DATTEO_Pos) /* (SDHC_EISTER) Masked Position  */
#define SDHC_EISTER_DATTEO_ENABLED            (SDHC_EISTER_DATTEO_ENABLED_Val << SDHC_EISTER_DATTEO_Pos) /* (SDHC_EISTER) Enabled Position  */
#define SDHC_EISTER_DATCRC_Pos                _UINT16_(5)                                          /* (SDHC_EISTER) Data CRC Error Status Enable Position */
#define SDHC_EISTER_DATCRC_Msk                (_UINT16_(0x1) << SDHC_EISTER_DATCRC_Pos)            /* (SDHC_EISTER) Data CRC Error Status Enable Mask */
#define SDHC_EISTER_DATCRC(value)             (SDHC_EISTER_DATCRC_Msk & (_UINT16_(value) << SDHC_EISTER_DATCRC_Pos)) /* Assigment of value for DATCRC in the SDHC_EISTER register */
#define   SDHC_EISTER_DATCRC_MASKED_Val       _UINT16_(0x0)                                        /* (SDHC_EISTER) Masked  */
#define   SDHC_EISTER_DATCRC_ENABLED_Val      _UINT16_(0x1)                                        /* (SDHC_EISTER) Enabled  */
#define SDHC_EISTER_DATCRC_MASKED             (SDHC_EISTER_DATCRC_MASKED_Val << SDHC_EISTER_DATCRC_Pos) /* (SDHC_EISTER) Masked Position  */
#define SDHC_EISTER_DATCRC_ENABLED            (SDHC_EISTER_DATCRC_ENABLED_Val << SDHC_EISTER_DATCRC_Pos) /* (SDHC_EISTER) Enabled Position  */
#define SDHC_EISTER_DATEND_Pos                _UINT16_(6)                                          /* (SDHC_EISTER) Data End Bit Error Status Enable Position */
#define SDHC_EISTER_DATEND_Msk                (_UINT16_(0x1) << SDHC_EISTER_DATEND_Pos)            /* (SDHC_EISTER) Data End Bit Error Status Enable Mask */
#define SDHC_EISTER_DATEND(value)             (SDHC_EISTER_DATEND_Msk & (_UINT16_(value) << SDHC_EISTER_DATEND_Pos)) /* Assigment of value for DATEND in the SDHC_EISTER register */
#define   SDHC_EISTER_DATEND_MASKED_Val       _UINT16_(0x0)                                        /* (SDHC_EISTER) Masked  */
#define   SDHC_EISTER_DATEND_ENABLED_Val      _UINT16_(0x1)                                        /* (SDHC_EISTER) Enabled  */
#define SDHC_EISTER_DATEND_MASKED             (SDHC_EISTER_DATEND_MASKED_Val << SDHC_EISTER_DATEND_Pos) /* (SDHC_EISTER) Masked Position  */
#define SDHC_EISTER_DATEND_ENABLED            (SDHC_EISTER_DATEND_ENABLED_Val << SDHC_EISTER_DATEND_Pos) /* (SDHC_EISTER) Enabled Position  */
#define SDHC_EISTER_CURLIM_Pos                _UINT16_(7)                                          /* (SDHC_EISTER) Current Limit Error Status Enable Position */
#define SDHC_EISTER_CURLIM_Msk                (_UINT16_(0x1) << SDHC_EISTER_CURLIM_Pos)            /* (SDHC_EISTER) Current Limit Error Status Enable Mask */
#define SDHC_EISTER_CURLIM(value)             (SDHC_EISTER_CURLIM_Msk & (_UINT16_(value) << SDHC_EISTER_CURLIM_Pos)) /* Assigment of value for CURLIM in the SDHC_EISTER register */
#define   SDHC_EISTER_CURLIM_MASKED_Val       _UINT16_(0x0)                                        /* (SDHC_EISTER) Masked  */
#define   SDHC_EISTER_CURLIM_ENABLED_Val      _UINT16_(0x1)                                        /* (SDHC_EISTER) Enabled  */
#define SDHC_EISTER_CURLIM_MASKED             (SDHC_EISTER_CURLIM_MASKED_Val << SDHC_EISTER_CURLIM_Pos) /* (SDHC_EISTER) Masked Position  */
#define SDHC_EISTER_CURLIM_ENABLED            (SDHC_EISTER_CURLIM_ENABLED_Val << SDHC_EISTER_CURLIM_Pos) /* (SDHC_EISTER) Enabled Position  */
#define SDHC_EISTER_ACMD_Pos                  _UINT16_(8)                                          /* (SDHC_EISTER) Auto CMD Error Status Enable Position */
#define SDHC_EISTER_ACMD_Msk                  (_UINT16_(0x1) << SDHC_EISTER_ACMD_Pos)              /* (SDHC_EISTER) Auto CMD Error Status Enable Mask */
#define SDHC_EISTER_ACMD(value)               (SDHC_EISTER_ACMD_Msk & (_UINT16_(value) << SDHC_EISTER_ACMD_Pos)) /* Assigment of value for ACMD in the SDHC_EISTER register */
#define   SDHC_EISTER_ACMD_MASKED_Val         _UINT16_(0x0)                                        /* (SDHC_EISTER) Masked  */
#define   SDHC_EISTER_ACMD_ENABLED_Val        _UINT16_(0x1)                                        /* (SDHC_EISTER) Enabled  */
#define SDHC_EISTER_ACMD_MASKED               (SDHC_EISTER_ACMD_MASKED_Val << SDHC_EISTER_ACMD_Pos) /* (SDHC_EISTER) Masked Position  */
#define SDHC_EISTER_ACMD_ENABLED              (SDHC_EISTER_ACMD_ENABLED_Val << SDHC_EISTER_ACMD_Pos) /* (SDHC_EISTER) Enabled Position  */
#define SDHC_EISTER_ADMA_Pos                  _UINT16_(9)                                          /* (SDHC_EISTER) ADMA Error Status Enable Position */
#define SDHC_EISTER_ADMA_Msk                  (_UINT16_(0x1) << SDHC_EISTER_ADMA_Pos)              /* (SDHC_EISTER) ADMA Error Status Enable Mask */
#define SDHC_EISTER_ADMA(value)               (SDHC_EISTER_ADMA_Msk & (_UINT16_(value) << SDHC_EISTER_ADMA_Pos)) /* Assigment of value for ADMA in the SDHC_EISTER register */
#define   SDHC_EISTER_ADMA_MASKED_Val         _UINT16_(0x0)                                        /* (SDHC_EISTER) Masked  */
#define   SDHC_EISTER_ADMA_ENABLED_Val        _UINT16_(0x1)                                        /* (SDHC_EISTER) Enabled  */
#define SDHC_EISTER_ADMA_MASKED               (SDHC_EISTER_ADMA_MASKED_Val << SDHC_EISTER_ADMA_Pos) /* (SDHC_EISTER) Masked Position  */
#define SDHC_EISTER_ADMA_ENABLED              (SDHC_EISTER_ADMA_ENABLED_Val << SDHC_EISTER_ADMA_Pos) /* (SDHC_EISTER) Enabled Position  */
#define SDHC_EISTER_Msk                       _UINT16_(0x03FF)                                     /* (SDHC_EISTER) Register Mask  */

/* EMMC mode */
#define SDHC_EISTER_EMMC_BOOTAE_Pos           _UINT16_(12)                                         /* (SDHC_EISTER) Boot Acknowledge Error Status Enable Position */
#define SDHC_EISTER_EMMC_BOOTAE_Msk           (_UINT16_(0x1) << SDHC_EISTER_EMMC_BOOTAE_Pos)       /* (SDHC_EISTER) Boot Acknowledge Error Status Enable Mask */
#define SDHC_EISTER_EMMC_BOOTAE(value)        (SDHC_EISTER_EMMC_BOOTAE_Msk & (_UINT16_(value) << SDHC_EISTER_EMMC_BOOTAE_Pos))
#define SDHC_EISTER_EMMC_Msk                  _UINT16_(0x1000)                                      /* (SDHC_EISTER_EMMC) Register Mask  */


