Microchip-MPLAB-Harmony/reference_apps/apps/pic32cx_sg61_cult/pic32cx_sg61_getting_started/firmware/src/packs/PIC32CX1025SG61128_DFP/component/sdhc.h
/* -------- SDHC_FERACES : (SDHC Offset: 0x50) ( /W 16) Force Event for Auto CMD Error Status -------- */
#define SDHC_FERACES_RESETVALUE               _UINT16_(0x00)                                       /*  (SDHC_FERACES) Force Event for Auto CMD Error Status  Reset Value */

#define SDHC_FERACES_ACMD12NE_Pos             _UINT16_(0)                                          /* (SDHC_FERACES) Force Event for Auto CMD12 Not Executed Position */
#define SDHC_FERACES_ACMD12NE_Msk             (_UINT16_(0x1) << SDHC_FERACES_ACMD12NE_Pos)         /* (SDHC_FERACES) Force Event for Auto CMD12 Not Executed Mask */
#define SDHC_FERACES_ACMD12NE(value)          (SDHC_FERACES_ACMD12NE_Msk & (_UINT16_(value) << SDHC_FERACES_ACMD12NE_Pos)) /* Assigment of value for ACMD12NE in the SDHC_FERACES register */
#define   SDHC_FERACES_ACMD12NE_NO_Val        _UINT16_(0x0)                                        /* (SDHC_FERACES) No Interrupt  */
#define   SDHC_FERACES_ACMD12NE_YES_Val       _UINT16_(0x1)                                        /* (SDHC_FERACES) Interrupt is generated  */
#define SDHC_FERACES_ACMD12NE_NO              (SDHC_FERACES_ACMD12NE_NO_Val << SDHC_FERACES_ACMD12NE_Pos) /* (SDHC_FERACES) No Interrupt Position  */
#define SDHC_FERACES_ACMD12NE_YES             (SDHC_FERACES_ACMD12NE_YES_Val << SDHC_FERACES_ACMD12NE_Pos) /* (SDHC_FERACES) Interrupt is generated Position  */
#define SDHC_FERACES_ACMDTEO_Pos              _UINT16_(1)                                          /* (SDHC_FERACES) Force Event for Auto CMD Timeout Error Position */
#define SDHC_FERACES_ACMDTEO_Msk              (_UINT16_(0x1) << SDHC_FERACES_ACMDTEO_Pos)          /* (SDHC_FERACES) Force Event for Auto CMD Timeout Error Mask */
#define SDHC_FERACES_ACMDTEO(value)           (SDHC_FERACES_ACMDTEO_Msk & (_UINT16_(value) << SDHC_FERACES_ACMDTEO_Pos)) /* Assigment of value for ACMDTEO in the SDHC_FERACES register */
#define   SDHC_FERACES_ACMDTEO_NO_Val         _UINT16_(0x0)                                        /* (SDHC_FERACES) No Interrupt  */
#define   SDHC_FERACES_ACMDTEO_YES_Val        _UINT16_(0x1)                                        /* (SDHC_FERACES) Interrupt is generated  */
#define SDHC_FERACES_ACMDTEO_NO               (SDHC_FERACES_ACMDTEO_NO_Val << SDHC_FERACES_ACMDTEO_Pos) /* (SDHC_FERACES) No Interrupt Position  */
#define SDHC_FERACES_ACMDTEO_YES              (SDHC_FERACES_ACMDTEO_YES_Val << SDHC_FERACES_ACMDTEO_Pos) /* (SDHC_FERACES) Interrupt is generated Position  */
#define SDHC_FERACES_ACMDCRC_Pos              _UINT16_(2)                                          /* (SDHC_FERACES) Force Event for Auto CMD CRC Error Position */
#define SDHC_FERACES_ACMDCRC_Msk              (_UINT16_(0x1) << SDHC_FERACES_ACMDCRC_Pos)          /* (SDHC_FERACES) Force Event for Auto CMD CRC Error Mask */
#define SDHC_FERACES_ACMDCRC(value)           (SDHC_FERACES_ACMDCRC_Msk & (_UINT16_(value) << SDHC_FERACES_ACMDCRC_Pos)) /* Assigment of value for ACMDCRC in the SDHC_FERACES register */
#define   SDHC_FERACES_ACMDCRC_NO_Val         _UINT16_(0x0)                                        /* (SDHC_FERACES) No Interrupt  */
#define   SDHC_FERACES_ACMDCRC_YES_Val        _UINT16_(0x1)                                        /* (SDHC_FERACES) Interrupt is generated  */
#define SDHC_FERACES_ACMDCRC_NO               (SDHC_FERACES_ACMDCRC_NO_Val << SDHC_FERACES_ACMDCRC_Pos) /* (SDHC_FERACES) No Interrupt Position  */
#define SDHC_FERACES_ACMDCRC_YES              (SDHC_FERACES_ACMDCRC_YES_Val << SDHC_FERACES_ACMDCRC_Pos) /* (SDHC_FERACES) Interrupt is generated Position  */
#define SDHC_FERACES_ACMDEND_Pos              _UINT16_(3)                                          /* (SDHC_FERACES) Force Event for Auto CMD End Bit Error Position */
#define SDHC_FERACES_ACMDEND_Msk              (_UINT16_(0x1) << SDHC_FERACES_ACMDEND_Pos)          /* (SDHC_FERACES) Force Event for Auto CMD End Bit Error Mask */
#define SDHC_FERACES_ACMDEND(value)           (SDHC_FERACES_ACMDEND_Msk & (_UINT16_(value) << SDHC_FERACES_ACMDEND_Pos)) /* Assigment of value for ACMDEND in the SDHC_FERACES register */
#define   SDHC_FERACES_ACMDEND_NO_Val         _UINT16_(0x0)                                        /* (SDHC_FERACES) No Interrupt  */
#define   SDHC_FERACES_ACMDEND_YES_Val        _UINT16_(0x1)                                        /* (SDHC_FERACES) Interrupt is generated  */
#define SDHC_FERACES_ACMDEND_NO               (SDHC_FERACES_ACMDEND_NO_Val << SDHC_FERACES_ACMDEND_Pos) /* (SDHC_FERACES) No Interrupt Position  */
#define SDHC_FERACES_ACMDEND_YES              (SDHC_FERACES_ACMDEND_YES_Val << SDHC_FERACES_ACMDEND_Pos) /* (SDHC_FERACES) Interrupt is generated Position  */
#define SDHC_FERACES_ACMDIDX_Pos              _UINT16_(4)                                          /* (SDHC_FERACES) Force Event for Auto CMD Index Error Position */
#define SDHC_FERACES_ACMDIDX_Msk              (_UINT16_(0x1) << SDHC_FERACES_ACMDIDX_Pos)          /* (SDHC_FERACES) Force Event for Auto CMD Index Error Mask */
#define SDHC_FERACES_ACMDIDX(value)           (SDHC_FERACES_ACMDIDX_Msk & (_UINT16_(value) << SDHC_FERACES_ACMDIDX_Pos)) /* Assigment of value for ACMDIDX in the SDHC_FERACES register */
#define   SDHC_FERACES_ACMDIDX_NO_Val         _UINT16_(0x0)                                        /* (SDHC_FERACES) No Interrupt  */
#define   SDHC_FERACES_ACMDIDX_YES_Val        _UINT16_(0x1)                                        /* (SDHC_FERACES) Interrupt is generated  */
#define SDHC_FERACES_ACMDIDX_NO               (SDHC_FERACES_ACMDIDX_NO_Val << SDHC_FERACES_ACMDIDX_Pos) /* (SDHC_FERACES) No Interrupt Position  */
#define SDHC_FERACES_ACMDIDX_YES              (SDHC_FERACES_ACMDIDX_YES_Val << SDHC_FERACES_ACMDIDX_Pos) /* (SDHC_FERACES) Interrupt is generated Position  */
#define SDHC_FERACES_CMDNI_Pos                _UINT16_(7)                                          /* (SDHC_FERACES) Force Event for Command Not Issued By Auto CMD12 Error Position */
#define SDHC_FERACES_CMDNI_Msk                (_UINT16_(0x1) << SDHC_FERACES_CMDNI_Pos)            /* (SDHC_FERACES) Force Event for Command Not Issued By Auto CMD12 Error Mask */
#define SDHC_FERACES_CMDNI(value)             (SDHC_FERACES_CMDNI_Msk & (_UINT16_(value) << SDHC_FERACES_CMDNI_Pos)) /* Assigment of value for CMDNI in the SDHC_FERACES register */
#define   SDHC_FERACES_CMDNI_NO_Val           _UINT16_(0x0)                                        /* (SDHC_FERACES) No Interrupt  */
#define   SDHC_FERACES_CMDNI_YES_Val          _UINT16_(0x1)                                        /* (SDHC_FERACES) Interrupt is generated  */
#define SDHC_FERACES_CMDNI_NO                 (SDHC_FERACES_CMDNI_NO_Val << SDHC_FERACES_CMDNI_Pos) /* (SDHC_FERACES) No Interrupt Position  */
#define SDHC_FERACES_CMDNI_YES                (SDHC_FERACES_CMDNI_YES_Val << SDHC_FERACES_CMDNI_Pos) /* (SDHC_FERACES) Interrupt is generated Position  */
#define SDHC_FERACES_Msk                      _UINT16_(0x009F)                                     /* (SDHC_FERACES) Register Mask  */


/* -------- SDHC_FEREIS : (SDHC Offset: 0x52) ( /W 16) Force Event for Error Interrupt Status -------- */
#define SDHC_FEREIS_RESETVALUE                _UINT16_(0x00)                                       /*  (SDHC_FEREIS) Force Event for Error Interrupt Status  Reset Value */

#define SDHC_FEREIS_CMDTEO_Pos                _UINT16_(0)                                          /* (SDHC_FEREIS) Force Event for Command Timeout Error Position */
#define SDHC_FEREIS_CMDTEO_Msk                (_UINT16_(0x1) << SDHC_FEREIS_CMDTEO_Pos)            /* (SDHC_FEREIS) Force Event for Command Timeout Error Mask */
#define SDHC_FEREIS_CMDTEO(value)             (SDHC_FEREIS_CMDTEO_Msk & (_UINT16_(value) << SDHC_FEREIS_CMDTEO_Pos)) /* Assigment of value for CMDTEO in the SDHC_FEREIS register */
#define   SDHC_FEREIS_CMDTEO_NO_Val           _UINT16_(0x0)                                        /* (SDHC_FEREIS) No Interrupt  */
#define   SDHC_FEREIS_CMDTEO_YES_Val          _UINT16_(0x1)                                        /* (SDHC_FEREIS) Interrupt is generated  */
#define SDHC_FEREIS_CMDTEO_NO                 (SDHC_FEREIS_CMDTEO_NO_Val << SDHC_FEREIS_CMDTEO_Pos) /* (SDHC_FEREIS) No Interrupt Position  */
#define SDHC_FEREIS_CMDTEO_YES                (SDHC_FEREIS_CMDTEO_YES_Val << SDHC_FEREIS_CMDTEO_Pos) /* (SDHC_FEREIS) Interrupt is generated Position  */
#define SDHC_FEREIS_CMDCRC_Pos                _UINT16_(1)                                          /* (SDHC_FEREIS) Force Event for Command CRC Error Position */
#define SDHC_FEREIS_CMDCRC_Msk                (_UINT16_(0x1) << SDHC_FEREIS_CMDCRC_Pos)            /* (SDHC_FEREIS) Force Event for Command CRC Error Mask */
#define SDHC_FEREIS_CMDCRC(value)             (SDHC_FEREIS_CMDCRC_Msk & (_UINT16_(value) << SDHC_FEREIS_CMDCRC_Pos)) /* Assigment of value for CMDCRC in the SDHC_FEREIS register */
#define   SDHC_FEREIS_CMDCRC_NO_Val           _UINT16_(0x0)                                        /* (SDHC_FEREIS) No Interrupt  */
#define   SDHC_FEREIS_CMDCRC_YES_Val          _UINT16_(0x1)                                        /* (SDHC_FEREIS) Interrupt is generated  */
#define SDHC_FEREIS_CMDCRC_NO                 (SDHC_FEREIS_CMDCRC_NO_Val << SDHC_FEREIS_CMDCRC_Pos) /* (SDHC_FEREIS) No Interrupt Position  */
#define SDHC_FEREIS_CMDCRC_YES                (SDHC_FEREIS_CMDCRC_YES_Val << SDHC_FEREIS_CMDCRC_Pos) /* (SDHC_FEREIS) Interrupt is generated Position  */
#define SDHC_FEREIS_CMDEND_Pos                _UINT16_(2)                                          /* (SDHC_FEREIS) Force Event for Command End Bit Error Position */
#define SDHC_FEREIS_CMDEND_Msk                (_UINT16_(0x1) << SDHC_FEREIS_CMDEND_Pos)            /* (SDHC_FEREIS) Force Event for Command End Bit Error Mask */
#define SDHC_FEREIS_CMDEND(value)             (SDHC_FEREIS_CMDEND_Msk & (_UINT16_(value) << SDHC_FEREIS_CMDEND_Pos)) /* Assigment of value for CMDEND in the SDHC_FEREIS register */
#define   SDHC_FEREIS_CMDEND_NO_Val           _UINT16_(0x0)                                        /* (SDHC_FEREIS) No Interrupt  */
#define   SDHC_FEREIS_CMDEND_YES_Val          _UINT16_(0x1)                                        /* (SDHC_FEREIS) Interrupt is generated  */
#define SDHC_FEREIS_CMDEND_NO                 (SDHC_FEREIS_CMDEND_NO_Val << SDHC_FEREIS_CMDEND_Pos) /* (SDHC_FEREIS) No Interrupt Position  */
#define SDHC_FEREIS_CMDEND_YES                (SDHC_FEREIS_CMDEND_YES_Val << SDHC_FEREIS_CMDEND_Pos) /* (SDHC_FEREIS) Interrupt is generated Position  */
#define SDHC_FEREIS_CMDIDX_Pos                _UINT16_(3)                                          /* (SDHC_FEREIS) Force Event for Command Index Error Position */
#define SDHC_FEREIS_CMDIDX_Msk                (_UINT16_(0x1) << SDHC_FEREIS_CMDIDX_Pos)            /* (SDHC_FEREIS) Force Event for Command Index Error Mask */
#define SDHC_FEREIS_CMDIDX(value)             (SDHC_FEREIS_CMDIDX_Msk & (_UINT16_(value) << SDHC_FEREIS_CMDIDX_Pos)) /* Assigment of value for CMDIDX in the SDHC_FEREIS register */
#define   SDHC_FEREIS_CMDIDX_NO_Val           _UINT16_(0x0)                                        /* (SDHC_FEREIS) No Interrupt  */
#define   SDHC_FEREIS_CMDIDX_YES_Val          _UINT16_(0x1)                                        /* (SDHC_FEREIS) Interrupt is generated  */
#define SDHC_FEREIS_CMDIDX_NO                 (SDHC_FEREIS_CMDIDX_NO_Val << SDHC_FEREIS_CMDIDX_Pos) /* (SDHC_FEREIS) No Interrupt Position  */
#define SDHC_FEREIS_CMDIDX_YES                (SDHC_FEREIS_CMDIDX_YES_Val << SDHC_FEREIS_CMDIDX_Pos) /* (SDHC_FEREIS) Interrupt is generated Position  */
#define SDHC_FEREIS_DATTEO_Pos                _UINT16_(4)                                          /* (SDHC_FEREIS) Force Event for Data Timeout Error Position */
#define SDHC_FEREIS_DATTEO_Msk                (_UINT16_(0x1) << SDHC_FEREIS_DATTEO_Pos)            /* (SDHC_FEREIS) Force Event for Data Timeout Error Mask */
#define SDHC_FEREIS_DATTEO(value)             (SDHC_FEREIS_DATTEO_Msk & (_UINT16_(value) << SDHC_FEREIS_DATTEO_Pos)) /* Assigment of value for DATTEO in the SDHC_FEREIS register */
#define   SDHC_FEREIS_DATTEO_NO_Val           _UINT16_(0x0)                                        /* (SDHC_FEREIS) No Interrupt  */
#define   SDHC_FEREIS_DATTEO_YES_Val          _UINT16_(0x1)                                        /* (SDHC_FEREIS) Interrupt is generated  */
#define SDHC_FEREIS_DATTEO_NO                 (SDHC_FEREIS_DATTEO_NO_Val << SDHC_FEREIS_DATTEO_Pos) /* (SDHC_FEREIS) No Interrupt Position  */
#define SDHC_FEREIS_DATTEO_YES                (SDHC_FEREIS_DATTEO_YES_Val << SDHC_FEREIS_DATTEO_Pos) /* (SDHC_FEREIS) Interrupt is generated Position  */
#define SDHC_FEREIS_DATCRC_Pos                _UINT16_(5)                                          /* (SDHC_FEREIS) Force Event for Data CRC Error Position */
#define SDHC_FEREIS_DATCRC_Msk                (_UINT16_(0x1) << SDHC_FEREIS_DATCRC_Pos)            /* (SDHC_FEREIS) Force Event for Data CRC Error Mask */
#define SDHC_FEREIS_DATCRC(value)             (SDHC_FEREIS_DATCRC_Msk & (_UINT16_(value) << SDHC_FEREIS_DATCRC_Pos)) /* Assigment of value for DATCRC in the SDHC_FEREIS register */
#define   SDHC_FEREIS_DATCRC_NO_Val           _UINT16_(0x0)                                        /* (SDHC_FEREIS) No Interrupt  */
#define   SDHC_FEREIS_DATCRC_YES_Val          _UINT16_(0x1)                                        /* (SDHC_FEREIS) Interrupt is generated  */
#define SDHC_FEREIS_DATCRC_NO                 (SDHC_FEREIS_DATCRC_NO_Val << SDHC_FEREIS_DATCRC_Pos) /* (SDHC_FEREIS) No Interrupt Position  */
#define SDHC_FEREIS_DATCRC_YES                (SDHC_FEREIS_DATCRC_YES_Val << SDHC_FEREIS_DATCRC_Pos) /* (SDHC_FEREIS) Interrupt is generated Position  */
#define SDHC_FEREIS_DATEND_Pos                _UINT16_(6)                                          /* (SDHC_FEREIS) Force Event for Data End Bit Error Position */
#define SDHC_FEREIS_DATEND_Msk                (_UINT16_(0x1) << SDHC_FEREIS_DATEND_Pos)            /* (SDHC_FEREIS) Force Event for Data End Bit Error Mask */
#define SDHC_FEREIS_DATEND(value)             (SDHC_FEREIS_DATEND_Msk & (_UINT16_(value) << SDHC_FEREIS_DATEND_Pos)) /* Assigment of value for DATEND in the SDHC_FEREIS register */
#define   SDHC_FEREIS_DATEND_NO_Val           _UINT16_(0x0)                                        /* (SDHC_FEREIS) No Interrupt  */
#define   SDHC_FEREIS_DATEND_YES_Val          _UINT16_(0x1)                                        /* (SDHC_FEREIS) Interrupt is generated  */
#define SDHC_FEREIS_DATEND_NO                 (SDHC_FEREIS_DATEND_NO_Val << SDHC_FEREIS_DATEND_Pos) /* (SDHC_FEREIS) No Interrupt Position  */
#define SDHC_FEREIS_DATEND_YES                (SDHC_FEREIS_DATEND_YES_Val << SDHC_FEREIS_DATEND_Pos) /* (SDHC_FEREIS) Interrupt is generated Position  */
#define SDHC_FEREIS_CURLIM_Pos                _UINT16_(7)                                          /* (SDHC_FEREIS) Force Event for Current Limit Error Position */
#define SDHC_FEREIS_CURLIM_Msk                (_UINT16_(0x1) << SDHC_FEREIS_CURLIM_Pos)            /* (SDHC_FEREIS) Force Event for Current Limit Error Mask */
#define SDHC_FEREIS_CURLIM(value)             (SDHC_FEREIS_CURLIM_Msk & (_UINT16_(value) << SDHC_FEREIS_CURLIM_Pos)) /* Assigment of value for CURLIM in the SDHC_FEREIS register */
#define   SDHC_FEREIS_CURLIM_NO_Val           _UINT16_(0x0)                                        /* (SDHC_FEREIS) No Interrupt  */
#define   SDHC_FEREIS_CURLIM_YES_Val          _UINT16_(0x1)                                        /* (SDHC_FEREIS) Interrupt is generated  */
#define SDHC_FEREIS_CURLIM_NO                 (SDHC_FEREIS_CURLIM_NO_Val << SDHC_FEREIS_CURLIM_Pos) /* (SDHC_FEREIS) No Interrupt Position  */
#define SDHC_FEREIS_CURLIM_YES                (SDHC_FEREIS_CURLIM_YES_Val << SDHC_FEREIS_CURLIM_Pos) /* (SDHC_FEREIS) Interrupt is generated Position  */
#define SDHC_FEREIS_ACMD_Pos                  _UINT16_(8)                                          /* (SDHC_FEREIS) Force Event for Auto CMD Error Position */
#define SDHC_FEREIS_ACMD_Msk                  (_UINT16_(0x1) << SDHC_FEREIS_ACMD_Pos)              /* (SDHC_FEREIS) Force Event for Auto CMD Error Mask */
#define SDHC_FEREIS_ACMD(value)               (SDHC_FEREIS_ACMD_Msk & (_UINT16_(value) << SDHC_FEREIS_ACMD_Pos)) /* Assigment of value for ACMD in the SDHC_FEREIS register */
#define   SDHC_FEREIS_ACMD_NO_Val             _UINT16_(0x0)                                        /* (SDHC_FEREIS) No Interrupt  */
#define   SDHC_FEREIS_ACMD_YES_Val            _UINT16_(0x1)                                        /* (SDHC_FEREIS) Interrupt is generated  */
#define SDHC_FEREIS_ACMD_NO                   (SDHC_FEREIS_ACMD_NO_Val << SDHC_FEREIS_ACMD_Pos)    /* (SDHC_FEREIS) No Interrupt Position  */
#define SDHC_FEREIS_ACMD_YES                  (SDHC_FEREIS_ACMD_YES_Val << SDHC_FEREIS_ACMD_Pos)   /* (SDHC_FEREIS) Interrupt is generated Position  */
#define SDHC_FEREIS_ADMA_Pos                  _UINT16_(9)                                          /* (SDHC_FEREIS) Force Event for ADMA Error Position */
#define SDHC_FEREIS_ADMA_Msk                  (_UINT16_(0x1) << SDHC_FEREIS_ADMA_Pos)              /* (SDHC_FEREIS) Force Event for ADMA Error Mask */
#define SDHC_FEREIS_ADMA(value)               (SDHC_FEREIS_ADMA_Msk & (_UINT16_(value) << SDHC_FEREIS_ADMA_Pos)) /* Assigment of value for ADMA in the SDHC_FEREIS register */
#define   SDHC_FEREIS_ADMA_NO_Val             _UINT16_(0x0)                                        /* (SDHC_FEREIS) No Interrupt  */
#define   SDHC_FEREIS_ADMA_YES_Val            _UINT16_(0x1)                                        /* (SDHC_FEREIS) Interrupt is generated  */
#define SDHC_FEREIS_ADMA_NO                   (SDHC_FEREIS_ADMA_NO_Val << SDHC_FEREIS_ADMA_Pos)    /* (SDHC_FEREIS) No Interrupt Position  */
#define SDHC_FEREIS_ADMA_YES                  (SDHC_FEREIS_ADMA_YES_Val << SDHC_FEREIS_ADMA_Pos)   /* (SDHC_FEREIS) Interrupt is generated Position  */
#define SDHC_FEREIS_BOOTAE_Pos                _UINT16_(12)                                         /* (SDHC_FEREIS) Force Event for Boot Acknowledge Error Position */
#define SDHC_FEREIS_BOOTAE_Msk                (_UINT16_(0x1) << SDHC_FEREIS_BOOTAE_Pos)            /* (SDHC_FEREIS) Force Event for Boot Acknowledge Error Mask */
#define SDHC_FEREIS_BOOTAE(value)             (SDHC_FEREIS_BOOTAE_Msk & (_UINT16_(value) << SDHC_FEREIS_BOOTAE_Pos)) /* Assigment of value for BOOTAE in the SDHC_FEREIS register */
#define   SDHC_FEREIS_BOOTAE_NO_Val           _UINT16_(0x0)                                        /* (SDHC_FEREIS) No Interrupt  */
#define   SDHC_FEREIS_BOOTAE_YES_Val          _UINT16_(0x1)                                        /* (SDHC_FEREIS) Interrupt is generated  */
#define SDHC_FEREIS_BOOTAE_NO                 (SDHC_FEREIS_BOOTAE_NO_Val << SDHC_FEREIS_BOOTAE_Pos) /* (SDHC_FEREIS) No Interrupt Position  */
#define SDHC_FEREIS_BOOTAE_YES                (SDHC_FEREIS_BOOTAE_YES_Val << SDHC_FEREIS_BOOTAE_Pos) /* (SDHC_FEREIS) Interrupt is generated Position  */
#define SDHC_FEREIS_Msk                       _UINT16_(0x13FF)                                     /* (SDHC_FEREIS) Register Mask  */


/* -------- SDHC_HC1R : (SDHC Offset: 0x28) (R/W 8) Host Control 1 -------- */
#define SDHC_HC1R_RESETVALUE                  _UINT8_(0xE00)                                       /*  (SDHC_HC1R) Host Control 1  Reset Value */

