Microchip-MPLAB-Harmony/reference_apps/apps/pic32cx_sg61_cult/pic32cx_sg61_getting_started/firmware/src/packs/PIC32CX1025SG61128_DFP/component/sdhc.h
#define SDHC_HC1R_LEDCTRL_Pos                 _UINT8_(0)                                           /* (SDHC_HC1R) LED Control Position */
#define SDHC_HC1R_LEDCTRL_Msk                 (_UINT8_(0x1) << SDHC_HC1R_LEDCTRL_Pos)              /* (SDHC_HC1R) LED Control Mask */
#define SDHC_HC1R_LEDCTRL(value)              (SDHC_HC1R_LEDCTRL_Msk & (_UINT8_(value) << SDHC_HC1R_LEDCTRL_Pos)) /* Assigment of value for LEDCTRL in the SDHC_HC1R register */
#define   SDHC_HC1R_LEDCTRL_OFF_Val           _UINT8_(0x0)                                         /* (SDHC_HC1R) LED off  */
#define   SDHC_HC1R_LEDCTRL_ON_Val            _UINT8_(0x1)                                         /* (SDHC_HC1R) LED on  */
#define SDHC_HC1R_LEDCTRL_OFF                 (SDHC_HC1R_LEDCTRL_OFF_Val << SDHC_HC1R_LEDCTRL_Pos) /* (SDHC_HC1R) LED off Position  */
#define SDHC_HC1R_LEDCTRL_ON                  (SDHC_HC1R_LEDCTRL_ON_Val << SDHC_HC1R_LEDCTRL_Pos)  /* (SDHC_HC1R) LED on Position  */
#define SDHC_HC1R_DW_Pos                      _UINT8_(1)                                           /* (SDHC_HC1R) Data Width Position */
#define SDHC_HC1R_DW_Msk                      (_UINT8_(0x1) << SDHC_HC1R_DW_Pos)                   /* (SDHC_HC1R) Data Width Mask */
#define SDHC_HC1R_DW(value)                   (SDHC_HC1R_DW_Msk & (_UINT8_(value) << SDHC_HC1R_DW_Pos)) /* Assigment of value for DW in the SDHC_HC1R register */
#define   SDHC_HC1R_DW_1BIT_Val               _UINT8_(0x0)                                         /* (SDHC_HC1R) 1-bit mode  */
#define   SDHC_HC1R_DW_4BIT_Val               _UINT8_(0x1)                                         /* (SDHC_HC1R) 4-bit mode  */
#define SDHC_HC1R_DW_1BIT                     (SDHC_HC1R_DW_1BIT_Val << SDHC_HC1R_DW_Pos)          /* (SDHC_HC1R) 1-bit mode Position  */
#define SDHC_HC1R_DW_4BIT                     (SDHC_HC1R_DW_4BIT_Val << SDHC_HC1R_DW_Pos)          /* (SDHC_HC1R) 4-bit mode Position  */
#define SDHC_HC1R_HSEN_Pos                    _UINT8_(2)                                           /* (SDHC_HC1R) High Speed Enable Position */
#define SDHC_HC1R_HSEN_Msk                    (_UINT8_(0x1) << SDHC_HC1R_HSEN_Pos)                 /* (SDHC_HC1R) High Speed Enable Mask */
#define SDHC_HC1R_HSEN(value)                 (SDHC_HC1R_HSEN_Msk & (_UINT8_(value) << SDHC_HC1R_HSEN_Pos)) /* Assigment of value for HSEN in the SDHC_HC1R register */
#define   SDHC_HC1R_HSEN_NORMAL_Val           _UINT8_(0x0)                                         /* (SDHC_HC1R) Normal Speed mode  */
#define   SDHC_HC1R_HSEN_HIGH_Val             _UINT8_(0x1)                                         /* (SDHC_HC1R) High Speed mode  */
#define SDHC_HC1R_HSEN_NORMAL                 (SDHC_HC1R_HSEN_NORMAL_Val << SDHC_HC1R_HSEN_Pos)    /* (SDHC_HC1R) Normal Speed mode Position  */
#define SDHC_HC1R_HSEN_HIGH                   (SDHC_HC1R_HSEN_HIGH_Val << SDHC_HC1R_HSEN_Pos)      /* (SDHC_HC1R) High Speed mode Position  */
#define SDHC_HC1R_DMASEL_Pos                  _UINT8_(3)                                           /* (SDHC_HC1R) DMA Select Position */
#define SDHC_HC1R_DMASEL_Msk                  (_UINT8_(0x3) << SDHC_HC1R_DMASEL_Pos)               /* (SDHC_HC1R) DMA Select Mask */
#define SDHC_HC1R_DMASEL(value)               (SDHC_HC1R_DMASEL_Msk & (_UINT8_(value) << SDHC_HC1R_DMASEL_Pos)) /* Assigment of value for DMASEL in the SDHC_HC1R register */
#define   SDHC_HC1R_DMASEL_SDMA_Val           _UINT8_(0x0)                                         /* (SDHC_HC1R) SDMA is selected  */
#define   SDHC_HC1R_DMASEL_32BIT_Val          _UINT8_(0x2)                                         /* (SDHC_HC1R) 32-bit Address ADMA2 is selected  */
#define SDHC_HC1R_DMASEL_SDMA                 (SDHC_HC1R_DMASEL_SDMA_Val << SDHC_HC1R_DMASEL_Pos)  /* (SDHC_HC1R) SDMA is selected Position  */
#define SDHC_HC1R_DMASEL_32BIT                (SDHC_HC1R_DMASEL_32BIT_Val << SDHC_HC1R_DMASEL_Pos) /* (SDHC_HC1R) 32-bit Address ADMA2 is selected Position  */
#define SDHC_HC1R_CARDDTL_Pos                 _UINT8_(6)                                           /* (SDHC_HC1R) Card Detect Test Level Position */
#define SDHC_HC1R_CARDDTL_Msk                 (_UINT8_(0x1) << SDHC_HC1R_CARDDTL_Pos)              /* (SDHC_HC1R) Card Detect Test Level Mask */
#define SDHC_HC1R_CARDDTL(value)              (SDHC_HC1R_CARDDTL_Msk & (_UINT8_(value) << SDHC_HC1R_CARDDTL_Pos)) /* Assigment of value for CARDDTL in the SDHC_HC1R register */
#define   SDHC_HC1R_CARDDTL_NO_Val            _UINT8_(0x0)                                         /* (SDHC_HC1R) No Card  */
#define   SDHC_HC1R_CARDDTL_YES_Val           _UINT8_(0x1)                                         /* (SDHC_HC1R) Card Inserted  */
#define SDHC_HC1R_CARDDTL_NO                  (SDHC_HC1R_CARDDTL_NO_Val << SDHC_HC1R_CARDDTL_Pos)  /* (SDHC_HC1R) No Card Position  */
#define SDHC_HC1R_CARDDTL_YES                 (SDHC_HC1R_CARDDTL_YES_Val << SDHC_HC1R_CARDDTL_Pos) /* (SDHC_HC1R) Card Inserted Position  */
#define SDHC_HC1R_CARDDSEL_Pos                _UINT8_(7)                                           /* (SDHC_HC1R) Card Detect Signal Selection Position */
#define SDHC_HC1R_CARDDSEL_Msk                (_UINT8_(0x1) << SDHC_HC1R_CARDDSEL_Pos)             /* (SDHC_HC1R) Card Detect Signal Selection Mask */
#define SDHC_HC1R_CARDDSEL(value)             (SDHC_HC1R_CARDDSEL_Msk & (_UINT8_(value) << SDHC_HC1R_CARDDSEL_Pos)) /* Assigment of value for CARDDSEL in the SDHC_HC1R register */
#define   SDHC_HC1R_CARDDSEL_NORMAL_Val       _UINT8_(0x0)                                         /* (SDHC_HC1R) SDCD# is selected (for normal use)  */
#define   SDHC_HC1R_CARDDSEL_TEST_Val         _UINT8_(0x1)                                         /* (SDHC_HC1R) The Card Select Test Level is selected (for test purpose)  */
#define SDHC_HC1R_CARDDSEL_NORMAL             (SDHC_HC1R_CARDDSEL_NORMAL_Val << SDHC_HC1R_CARDDSEL_Pos) /* (SDHC_HC1R) SDCD# is selected (for normal use) Position  */
#define SDHC_HC1R_CARDDSEL_TEST               (SDHC_HC1R_CARDDSEL_TEST_Val << SDHC_HC1R_CARDDSEL_Pos) /* (SDHC_HC1R) The Card Select Test Level is selected (for test purpose) Position  */
#define SDHC_HC1R_Msk                         _UINT8_(0xDF)                                        /* (SDHC_HC1R) Register Mask  */

/* EMMC mode */
#define SDHC_HC1R_EMMC_Msk                    _UINT8_(0x00)                                         /* (SDHC_HC1R_EMMC) Register Mask  */


/* -------- SDHC_HC2R : (SDHC Offset: 0x3E) (R/W 16) Host Control 2 -------- */
#define SDHC_HC2R_RESETVALUE                  _UINT16_(0x00)                                       /*  (SDHC_HC2R) Host Control 2  Reset Value */

