Microchip-MPLAB-Harmony/reference_apps/apps/pic32cx_sg61_cult/pic32cx_sg61_getting_started/firmware/src/packs/PIC32CX1025SG61128_DFP/component/sdhc.h
#define SDHC_HC2R_UHSMS_Pos                   _UINT16_(0)                                          /* (SDHC_HC2R) UHS Mode Select Position */
#define SDHC_HC2R_UHSMS_Msk                   (_UINT16_(0x7) << SDHC_HC2R_UHSMS_Pos)               /* (SDHC_HC2R) UHS Mode Select Mask */
#define SDHC_HC2R_UHSMS(value)                (SDHC_HC2R_UHSMS_Msk & (_UINT16_(value) << SDHC_HC2R_UHSMS_Pos)) /* Assigment of value for UHSMS in the SDHC_HC2R register */
#define   SDHC_HC2R_UHSMS_SDR12_Val           _UINT16_(0x0)                                        /* (SDHC_HC2R) SDR12  */
#define   SDHC_HC2R_UHSMS_SDR25_Val           _UINT16_(0x1)                                        /* (SDHC_HC2R) SDR25  */
#define   SDHC_HC2R_UHSMS_SDR50_Val           _UINT16_(0x2)                                        /* (SDHC_HC2R) SDR50  */
#define   SDHC_HC2R_UHSMS_SDR104_Val          _UINT16_(0x3)                                        /* (SDHC_HC2R) SDR104  */
#define   SDHC_HC2R_UHSMS_DDR50_Val           _UINT16_(0x4)                                        /* (SDHC_HC2R) DDR50  */
#define SDHC_HC2R_UHSMS_SDR12                 (SDHC_HC2R_UHSMS_SDR12_Val << SDHC_HC2R_UHSMS_Pos)   /* (SDHC_HC2R) SDR12 Position  */
#define SDHC_HC2R_UHSMS_SDR25                 (SDHC_HC2R_UHSMS_SDR25_Val << SDHC_HC2R_UHSMS_Pos)   /* (SDHC_HC2R) SDR25 Position  */
#define SDHC_HC2R_UHSMS_SDR50                 (SDHC_HC2R_UHSMS_SDR50_Val << SDHC_HC2R_UHSMS_Pos)   /* (SDHC_HC2R) SDR50 Position  */
#define SDHC_HC2R_UHSMS_SDR104                (SDHC_HC2R_UHSMS_SDR104_Val << SDHC_HC2R_UHSMS_Pos)  /* (SDHC_HC2R) SDR104 Position  */
#define SDHC_HC2R_UHSMS_DDR50                 (SDHC_HC2R_UHSMS_DDR50_Val << SDHC_HC2R_UHSMS_Pos)   /* (SDHC_HC2R) DDR50 Position  */
#define SDHC_HC2R_VS18EN_Pos                  _UINT16_(3)                                          /* (SDHC_HC2R) 1.8V Signaling Enable Position */
#define SDHC_HC2R_VS18EN_Msk                  (_UINT16_(0x1) << SDHC_HC2R_VS18EN_Pos)              /* (SDHC_HC2R) 1.8V Signaling Enable Mask */
#define SDHC_HC2R_VS18EN(value)               (SDHC_HC2R_VS18EN_Msk & (_UINT16_(value) << SDHC_HC2R_VS18EN_Pos)) /* Assigment of value for VS18EN in the SDHC_HC2R register */
#define   SDHC_HC2R_VS18EN_S33V_Val           _UINT16_(0x0)                                        /* (SDHC_HC2R) 3.3V Signaling  */
#define   SDHC_HC2R_VS18EN_S18V_Val           _UINT16_(0x1)                                        /* (SDHC_HC2R) 1.8V Signaling  */
#define SDHC_HC2R_VS18EN_S33V                 (SDHC_HC2R_VS18EN_S33V_Val << SDHC_HC2R_VS18EN_Pos)  /* (SDHC_HC2R) 3.3V Signaling Position  */
#define SDHC_HC2R_VS18EN_S18V                 (SDHC_HC2R_VS18EN_S18V_Val << SDHC_HC2R_VS18EN_Pos)  /* (SDHC_HC2R) 1.8V Signaling Position  */
#define SDHC_HC2R_DRVSEL_Pos                  _UINT16_(4)                                          /* (SDHC_HC2R) Driver Strength Select Position */
#define SDHC_HC2R_DRVSEL_Msk                  (_UINT16_(0x3) << SDHC_HC2R_DRVSEL_Pos)              /* (SDHC_HC2R) Driver Strength Select Mask */
#define SDHC_HC2R_DRVSEL(value)               (SDHC_HC2R_DRVSEL_Msk & (_UINT16_(value) << SDHC_HC2R_DRVSEL_Pos)) /* Assigment of value for DRVSEL in the SDHC_HC2R register */
#define   SDHC_HC2R_DRVSEL_B_Val              _UINT16_(0x0)                                        /* (SDHC_HC2R) Driver Type B is Selected (Default)  */
#define   SDHC_HC2R_DRVSEL_A_Val              _UINT16_(0x1)                                        /* (SDHC_HC2R) Driver Type A is Selected  */
#define   SDHC_HC2R_DRVSEL_C_Val              _UINT16_(0x2)                                        /* (SDHC_HC2R) Driver Type C is Selected  */
#define   SDHC_HC2R_DRVSEL_D_Val              _UINT16_(0x3)                                        /* (SDHC_HC2R) Driver Type D is Selected  */
#define SDHC_HC2R_DRVSEL_B                    (SDHC_HC2R_DRVSEL_B_Val << SDHC_HC2R_DRVSEL_Pos)     /* (SDHC_HC2R) Driver Type B is Selected (Default) Position  */
#define SDHC_HC2R_DRVSEL_A                    (SDHC_HC2R_DRVSEL_A_Val << SDHC_HC2R_DRVSEL_Pos)     /* (SDHC_HC2R) Driver Type A is Selected Position  */
#define SDHC_HC2R_DRVSEL_C                    (SDHC_HC2R_DRVSEL_C_Val << SDHC_HC2R_DRVSEL_Pos)     /* (SDHC_HC2R) Driver Type C is Selected Position  */
#define SDHC_HC2R_DRVSEL_D                    (SDHC_HC2R_DRVSEL_D_Val << SDHC_HC2R_DRVSEL_Pos)     /* (SDHC_HC2R) Driver Type D is Selected Position  */
#define SDHC_HC2R_EXTUN_Pos                   _UINT16_(6)                                          /* (SDHC_HC2R) Execute Tuning Position */
#define SDHC_HC2R_EXTUN_Msk                   (_UINT16_(0x1) << SDHC_HC2R_EXTUN_Pos)               /* (SDHC_HC2R) Execute Tuning Mask */
#define SDHC_HC2R_EXTUN(value)                (SDHC_HC2R_EXTUN_Msk & (_UINT16_(value) << SDHC_HC2R_EXTUN_Pos)) /* Assigment of value for EXTUN in the SDHC_HC2R register */
#define   SDHC_HC2R_EXTUN_NO_Val              _UINT16_(0x0)                                        /* (SDHC_HC2R) Not Tuned or Tuning Completed  */
#define   SDHC_HC2R_EXTUN_REQUESTED_Val       _UINT16_(0x1)                                        /* (SDHC_HC2R) Execute Tuning  */
#define SDHC_HC2R_EXTUN_NO                    (SDHC_HC2R_EXTUN_NO_Val << SDHC_HC2R_EXTUN_Pos)      /* (SDHC_HC2R) Not Tuned or Tuning Completed Position  */
#define SDHC_HC2R_EXTUN_REQUESTED             (SDHC_HC2R_EXTUN_REQUESTED_Val << SDHC_HC2R_EXTUN_Pos) /* (SDHC_HC2R) Execute Tuning Position  */
#define SDHC_HC2R_SLCKSEL_Pos                 _UINT16_(7)                                          /* (SDHC_HC2R) Sampling Clock Select Position */
#define SDHC_HC2R_SLCKSEL_Msk                 (_UINT16_(0x1) << SDHC_HC2R_SLCKSEL_Pos)             /* (SDHC_HC2R) Sampling Clock Select Mask */
#define SDHC_HC2R_SLCKSEL(value)              (SDHC_HC2R_SLCKSEL_Msk & (_UINT16_(value) << SDHC_HC2R_SLCKSEL_Pos)) /* Assigment of value for SLCKSEL in the SDHC_HC2R register */
#define   SDHC_HC2R_SLCKSEL_FIXED_Val         _UINT16_(0x0)                                        /* (SDHC_HC2R) Fixed clock is used to sample data  */
#define   SDHC_HC2R_SLCKSEL_TUNED_Val         _UINT16_(0x1)                                        /* (SDHC_HC2R) Tuned clock is used to sample data  */
#define SDHC_HC2R_SLCKSEL_FIXED               (SDHC_HC2R_SLCKSEL_FIXED_Val << SDHC_HC2R_SLCKSEL_Pos) /* (SDHC_HC2R) Fixed clock is used to sample data Position  */
#define SDHC_HC2R_SLCKSEL_TUNED               (SDHC_HC2R_SLCKSEL_TUNED_Val << SDHC_HC2R_SLCKSEL_Pos) /* (SDHC_HC2R) Tuned clock is used to sample data Position  */
#define SDHC_HC2R_ASINTEN_Pos                 _UINT16_(14)                                         /* (SDHC_HC2R) Asynchronous Interrupt Enable Position */
#define SDHC_HC2R_ASINTEN_Msk                 (_UINT16_(0x1) << SDHC_HC2R_ASINTEN_Pos)             /* (SDHC_HC2R) Asynchronous Interrupt Enable Mask */
#define SDHC_HC2R_ASINTEN(value)              (SDHC_HC2R_ASINTEN_Msk & (_UINT16_(value) << SDHC_HC2R_ASINTEN_Pos)) /* Assigment of value for ASINTEN in the SDHC_HC2R register */
#define   SDHC_HC2R_ASINTEN_DISABLED_Val      _UINT16_(0x0)                                        /* (SDHC_HC2R) Disabled  */
#define   SDHC_HC2R_ASINTEN_ENABLED_Val       _UINT16_(0x1)                                        /* (SDHC_HC2R) Enabled  */
#define SDHC_HC2R_ASINTEN_DISABLED            (SDHC_HC2R_ASINTEN_DISABLED_Val << SDHC_HC2R_ASINTEN_Pos) /* (SDHC_HC2R) Disabled Position  */
#define SDHC_HC2R_ASINTEN_ENABLED             (SDHC_HC2R_ASINTEN_ENABLED_Val << SDHC_HC2R_ASINTEN_Pos) /* (SDHC_HC2R) Enabled Position  */
#define SDHC_HC2R_PVALEN_Pos                  _UINT16_(15)                                         /* (SDHC_HC2R) Preset Value Enable Position */
#define SDHC_HC2R_PVALEN_Msk                  (_UINT16_(0x1) << SDHC_HC2R_PVALEN_Pos)              /* (SDHC_HC2R) Preset Value Enable Mask */
#define SDHC_HC2R_PVALEN(value)               (SDHC_HC2R_PVALEN_Msk & (_UINT16_(value) << SDHC_HC2R_PVALEN_Pos)) /* Assigment of value for PVALEN in the SDHC_HC2R register */
#define   SDHC_HC2R_PVALEN_HOST_Val           _UINT16_(0x0)                                        /* (SDHC_HC2R) SDCLK and Driver Strength are controlled by Host Controller  */
#define   SDHC_HC2R_PVALEN_AUTO_Val           _UINT16_(0x1)                                        /* (SDHC_HC2R) Automatic Selection by Preset Value is Enabled  */
#define SDHC_HC2R_PVALEN_HOST                 (SDHC_HC2R_PVALEN_HOST_Val << SDHC_HC2R_PVALEN_Pos)  /* (SDHC_HC2R) SDCLK and Driver Strength are controlled by Host Controller Position  */
#define SDHC_HC2R_PVALEN_AUTO                 (SDHC_HC2R_PVALEN_AUTO_Val << SDHC_HC2R_PVALEN_Pos)  /* (SDHC_HC2R) Automatic Selection by Preset Value is Enabled Position  */
#define SDHC_HC2R_Msk                         _UINT16_(0xC0FF)                                     /* (SDHC_HC2R) Register Mask  */

/* EMMC mode */
#define SDHC_HC2R_EMMC_HS200EN_Pos            _UINT16_(0)                                          /* (SDHC_HC2R) HS200 Mode Enable Position */
#define SDHC_HC2R_EMMC_HS200EN_Msk            (_UINT16_(0xF) << SDHC_HC2R_EMMC_HS200EN_Pos)        /* (SDHC_HC2R) HS200 Mode Enable Mask */
#define SDHC_HC2R_EMMC_HS200EN(value)         (SDHC_HC2R_EMMC_HS200EN_Msk & (_UINT16_(value) << SDHC_HC2R_EMMC_HS200EN_Pos))
#define   SDHC_HC2R_EMMC_HS200EN_SDR12_Val    _UINT16_(0x0)                                        /* (SDHC_HC2R) SDR12  */
#define   SDHC_HC2R_EMMC_HS200EN_SDR25_Val    _UINT16_(0x1)                                        /* (SDHC_HC2R) SDR25  */
#define   SDHC_HC2R_EMMC_HS200EN_SDR50_Val    _UINT16_(0x2)                                        /* (SDHC_HC2R) SDR50  */
#define   SDHC_HC2R_EMMC_HS200EN_SDR104_Val   _UINT16_(0x3)                                        /* (SDHC_HC2R) SDR104  */
#define   SDHC_HC2R_EMMC_HS200EN_DDR50_Val    _UINT16_(0x4)                                        /* (SDHC_HC2R) DDR50  */
#define SDHC_HC2R_EMMC_HS200EN_SDR12          (SDHC_HC2R_EMMC_HS200EN_SDR12_Val << SDHC_HC2R_EMMC_HS200EN_Pos) /* (SDHC_HC2R) SDR12 Position  */
#define SDHC_HC2R_EMMC_HS200EN_SDR25          (SDHC_HC2R_EMMC_HS200EN_SDR25_Val << SDHC_HC2R_EMMC_HS200EN_Pos) /* (SDHC_HC2R) SDR25 Position  */
#define SDHC_HC2R_EMMC_HS200EN_SDR50          (SDHC_HC2R_EMMC_HS200EN_SDR50_Val << SDHC_HC2R_EMMC_HS200EN_Pos) /* (SDHC_HC2R) SDR50 Position  */
#define SDHC_HC2R_EMMC_HS200EN_SDR104         (SDHC_HC2R_EMMC_HS200EN_SDR104_Val << SDHC_HC2R_EMMC_HS200EN_Pos) /* (SDHC_HC2R) SDR104 Position  */
#define SDHC_HC2R_EMMC_HS200EN_DDR50          (SDHC_HC2R_EMMC_HS200EN_DDR50_Val << SDHC_HC2R_EMMC_HS200EN_Pos) /* (SDHC_HC2R) DDR50 Position  */
#define SDHC_HC2R_EMMC_Msk                    _UINT16_(0x000F)                                      /* (SDHC_HC2R_EMMC) Register Mask  */


