Microchip-MPLAB-Harmony/reference_apps/apps/pic32cx_sg61_cult/pic32cx_sg61_getting_started/firmware/src/packs/PIC32CX1025SG61128_DFP/component/sdhc.h
#define SDHC_MCCAR_MAXCUR33V_Pos              _UINT32_(0)                                          /* (SDHC_MCCAR) Maximum Current for 3.3V Position */
#define SDHC_MCCAR_MAXCUR33V_Msk              (_UINT32_(0xFF) << SDHC_MCCAR_MAXCUR33V_Pos)         /* (SDHC_MCCAR) Maximum Current for 3.3V Mask */
#define SDHC_MCCAR_MAXCUR33V(value)           (SDHC_MCCAR_MAXCUR33V_Msk & (_UINT32_(value) << SDHC_MCCAR_MAXCUR33V_Pos)) /* Assigment of value for MAXCUR33V in the SDHC_MCCAR register */
#define   SDHC_MCCAR_MAXCUR33V_OTHER_Val      _UINT32_(0x0)                                        /* (SDHC_MCCAR) Get information via another method  */
#define   SDHC_MCCAR_MAXCUR33V_4MA_Val        _UINT32_(0x1)                                        /* (SDHC_MCCAR) 4mA  */
#define   SDHC_MCCAR_MAXCUR33V_8MA_Val        _UINT32_(0x2)                                        /* (SDHC_MCCAR) 8mA  */
#define   SDHC_MCCAR_MAXCUR33V_12MA_Val       _UINT32_(0x3)                                        /* (SDHC_MCCAR) 12mA  */
#define SDHC_MCCAR_MAXCUR33V_OTHER            (SDHC_MCCAR_MAXCUR33V_OTHER_Val << SDHC_MCCAR_MAXCUR33V_Pos) /* (SDHC_MCCAR) Get information via another method Position  */
#define SDHC_MCCAR_MAXCUR33V_4MA              (SDHC_MCCAR_MAXCUR33V_4MA_Val << SDHC_MCCAR_MAXCUR33V_Pos) /* (SDHC_MCCAR) 4mA Position  */
#define SDHC_MCCAR_MAXCUR33V_8MA              (SDHC_MCCAR_MAXCUR33V_8MA_Val << SDHC_MCCAR_MAXCUR33V_Pos) /* (SDHC_MCCAR) 8mA Position  */
#define SDHC_MCCAR_MAXCUR33V_12MA             (SDHC_MCCAR_MAXCUR33V_12MA_Val << SDHC_MCCAR_MAXCUR33V_Pos) /* (SDHC_MCCAR) 12mA Position  */
#define SDHC_MCCAR_MAXCUR30V_Pos              _UINT32_(8)                                          /* (SDHC_MCCAR) Maximum Current for 3.0V Position */
#define SDHC_MCCAR_MAXCUR30V_Msk              (_UINT32_(0xFF) << SDHC_MCCAR_MAXCUR30V_Pos)         /* (SDHC_MCCAR) Maximum Current for 3.0V Mask */
#define SDHC_MCCAR_MAXCUR30V(value)           (SDHC_MCCAR_MAXCUR30V_Msk & (_UINT32_(value) << SDHC_MCCAR_MAXCUR30V_Pos)) /* Assigment of value for MAXCUR30V in the SDHC_MCCAR register */
#define   SDHC_MCCAR_MAXCUR30V_OTHER_Val      _UINT32_(0x0)                                        /* (SDHC_MCCAR) Get information via another method  */
#define   SDHC_MCCAR_MAXCUR30V_4MA_Val        _UINT32_(0x1)                                        /* (SDHC_MCCAR) 4mA  */
#define   SDHC_MCCAR_MAXCUR30V_8MA_Val        _UINT32_(0x2)                                        /* (SDHC_MCCAR) 8mA  */
#define   SDHC_MCCAR_MAXCUR30V_12MA_Val       _UINT32_(0x3)                                        /* (SDHC_MCCAR) 12mA  */
#define SDHC_MCCAR_MAXCUR30V_OTHER            (SDHC_MCCAR_MAXCUR30V_OTHER_Val << SDHC_MCCAR_MAXCUR30V_Pos) /* (SDHC_MCCAR) Get information via another method Position  */
#define SDHC_MCCAR_MAXCUR30V_4MA              (SDHC_MCCAR_MAXCUR30V_4MA_Val << SDHC_MCCAR_MAXCUR30V_Pos) /* (SDHC_MCCAR) 4mA Position  */
#define SDHC_MCCAR_MAXCUR30V_8MA              (SDHC_MCCAR_MAXCUR30V_8MA_Val << SDHC_MCCAR_MAXCUR30V_Pos) /* (SDHC_MCCAR) 8mA Position  */
#define SDHC_MCCAR_MAXCUR30V_12MA             (SDHC_MCCAR_MAXCUR30V_12MA_Val << SDHC_MCCAR_MAXCUR30V_Pos) /* (SDHC_MCCAR) 12mA Position  */
#define SDHC_MCCAR_MAXCUR18V_Pos              _UINT32_(16)                                         /* (SDHC_MCCAR) Maximum Current for 1.8V Position */
#define SDHC_MCCAR_MAXCUR18V_Msk              (_UINT32_(0xFF) << SDHC_MCCAR_MAXCUR18V_Pos)         /* (SDHC_MCCAR) Maximum Current for 1.8V Mask */
#define SDHC_MCCAR_MAXCUR18V(value)           (SDHC_MCCAR_MAXCUR18V_Msk & (_UINT32_(value) << SDHC_MCCAR_MAXCUR18V_Pos)) /* Assigment of value for MAXCUR18V in the SDHC_MCCAR register */
#define   SDHC_MCCAR_MAXCUR18V_OTHER_Val      _UINT32_(0x0)                                        /* (SDHC_MCCAR) Get information via another method  */
#define   SDHC_MCCAR_MAXCUR18V_4MA_Val        _UINT32_(0x1)                                        /* (SDHC_MCCAR) 4mA  */
#define   SDHC_MCCAR_MAXCUR18V_8MA_Val        _UINT32_(0x2)                                        /* (SDHC_MCCAR) 8mA  */
#define   SDHC_MCCAR_MAXCUR18V_12MA_Val       _UINT32_(0x3)                                        /* (SDHC_MCCAR) 12mA  */
#define SDHC_MCCAR_MAXCUR18V_OTHER            (SDHC_MCCAR_MAXCUR18V_OTHER_Val << SDHC_MCCAR_MAXCUR18V_Pos) /* (SDHC_MCCAR) Get information via another method Position  */
#define SDHC_MCCAR_MAXCUR18V_4MA              (SDHC_MCCAR_MAXCUR18V_4MA_Val << SDHC_MCCAR_MAXCUR18V_Pos) /* (SDHC_MCCAR) 4mA Position  */
#define SDHC_MCCAR_MAXCUR18V_8MA              (SDHC_MCCAR_MAXCUR18V_8MA_Val << SDHC_MCCAR_MAXCUR18V_Pos) /* (SDHC_MCCAR) 8mA Position  */
#define SDHC_MCCAR_MAXCUR18V_12MA             (SDHC_MCCAR_MAXCUR18V_12MA_Val << SDHC_MCCAR_MAXCUR18V_Pos) /* (SDHC_MCCAR) 12mA Position  */
#define SDHC_MCCAR_Msk                        _UINT32_(0x00FFFFFF)                                 /* (SDHC_MCCAR) Register Mask  */


/* -------- SDHC_NISIER : (SDHC Offset: 0x38) (R/W 16) Normal Interrupt Signal Enable -------- */
#define SDHC_NISIER_RESETVALUE                _UINT16_(0x00)                                       /*  (SDHC_NISIER) Normal Interrupt Signal Enable  Reset Value */

#define SDHC_NISIER_CMDC_Pos                  _UINT16_(0)                                          /* (SDHC_NISIER) Command Complete Signal Enable Position */
#define SDHC_NISIER_CMDC_Msk                  (_UINT16_(0x1) << SDHC_NISIER_CMDC_Pos)              /* (SDHC_NISIER) Command Complete Signal Enable Mask */
#define SDHC_NISIER_CMDC(value)               (SDHC_NISIER_CMDC_Msk & (_UINT16_(value) << SDHC_NISIER_CMDC_Pos)) /* Assigment of value for CMDC in the SDHC_NISIER register */
#define   SDHC_NISIER_CMDC_MASKED_Val         _UINT16_(0x0)                                        /* (SDHC_NISIER) Masked  */
#define   SDHC_NISIER_CMDC_ENABLED_Val        _UINT16_(0x1)                                        /* (SDHC_NISIER) Enabled  */
#define SDHC_NISIER_CMDC_MASKED               (SDHC_NISIER_CMDC_MASKED_Val << SDHC_NISIER_CMDC_Pos) /* (SDHC_NISIER) Masked Position  */
#define SDHC_NISIER_CMDC_ENABLED              (SDHC_NISIER_CMDC_ENABLED_Val << SDHC_NISIER_CMDC_Pos) /* (SDHC_NISIER) Enabled Position  */
#define SDHC_NISIER_TRFC_Pos                  _UINT16_(1)                                          /* (SDHC_NISIER) Transfer Complete Signal Enable Position */
#define SDHC_NISIER_TRFC_Msk                  (_UINT16_(0x1) << SDHC_NISIER_TRFC_Pos)              /* (SDHC_NISIER) Transfer Complete Signal Enable Mask */
#define SDHC_NISIER_TRFC(value)               (SDHC_NISIER_TRFC_Msk & (_UINT16_(value) << SDHC_NISIER_TRFC_Pos)) /* Assigment of value for TRFC in the SDHC_NISIER register */
#define   SDHC_NISIER_TRFC_MASKED_Val         _UINT16_(0x0)                                        /* (SDHC_NISIER) Masked  */
#define   SDHC_NISIER_TRFC_ENABLED_Val        _UINT16_(0x1)                                        /* (SDHC_NISIER) Enabled  */
#define SDHC_NISIER_TRFC_MASKED               (SDHC_NISIER_TRFC_MASKED_Val << SDHC_NISIER_TRFC_Pos) /* (SDHC_NISIER) Masked Position  */
#define SDHC_NISIER_TRFC_ENABLED              (SDHC_NISIER_TRFC_ENABLED_Val << SDHC_NISIER_TRFC_Pos) /* (SDHC_NISIER) Enabled Position  */
#define SDHC_NISIER_BLKGE_Pos                 _UINT16_(2)                                          /* (SDHC_NISIER) Block Gap Event Signal Enable Position */
#define SDHC_NISIER_BLKGE_Msk                 (_UINT16_(0x1) << SDHC_NISIER_BLKGE_Pos)             /* (SDHC_NISIER) Block Gap Event Signal Enable Mask */
#define SDHC_NISIER_BLKGE(value)              (SDHC_NISIER_BLKGE_Msk & (_UINT16_(value) << SDHC_NISIER_BLKGE_Pos)) /* Assigment of value for BLKGE in the SDHC_NISIER register */
#define   SDHC_NISIER_BLKGE_MASKED_Val        _UINT16_(0x0)                                        /* (SDHC_NISIER) Masked  */
#define   SDHC_NISIER_BLKGE_ENABLED_Val       _UINT16_(0x1)                                        /* (SDHC_NISIER) Enabled  */
#define SDHC_NISIER_BLKGE_MASKED              (SDHC_NISIER_BLKGE_MASKED_Val << SDHC_NISIER_BLKGE_Pos) /* (SDHC_NISIER) Masked Position  */
#define SDHC_NISIER_BLKGE_ENABLED             (SDHC_NISIER_BLKGE_ENABLED_Val << SDHC_NISIER_BLKGE_Pos) /* (SDHC_NISIER) Enabled Position  */
#define SDHC_NISIER_DMAINT_Pos                _UINT16_(3)                                          /* (SDHC_NISIER) DMA Interrupt Signal Enable Position */
#define SDHC_NISIER_DMAINT_Msk                (_UINT16_(0x1) << SDHC_NISIER_DMAINT_Pos)            /* (SDHC_NISIER) DMA Interrupt Signal Enable Mask */
#define SDHC_NISIER_DMAINT(value)             (SDHC_NISIER_DMAINT_Msk & (_UINT16_(value) << SDHC_NISIER_DMAINT_Pos)) /* Assigment of value for DMAINT in the SDHC_NISIER register */
#define   SDHC_NISIER_DMAINT_MASKED_Val       _UINT16_(0x0)                                        /* (SDHC_NISIER) Masked  */
#define   SDHC_NISIER_DMAINT_ENABLED_Val      _UINT16_(0x1)                                        /* (SDHC_NISIER) Enabled  */
#define SDHC_NISIER_DMAINT_MASKED             (SDHC_NISIER_DMAINT_MASKED_Val << SDHC_NISIER_DMAINT_Pos) /* (SDHC_NISIER) Masked Position  */
#define SDHC_NISIER_DMAINT_ENABLED            (SDHC_NISIER_DMAINT_ENABLED_Val << SDHC_NISIER_DMAINT_Pos) /* (SDHC_NISIER) Enabled Position  */
#define SDHC_NISIER_BWRRDY_Pos                _UINT16_(4)                                          /* (SDHC_NISIER) Buffer Write Ready Signal Enable Position */
#define SDHC_NISIER_BWRRDY_Msk                (_UINT16_(0x1) << SDHC_NISIER_BWRRDY_Pos)            /* (SDHC_NISIER) Buffer Write Ready Signal Enable Mask */
#define SDHC_NISIER_BWRRDY(value)             (SDHC_NISIER_BWRRDY_Msk & (_UINT16_(value) << SDHC_NISIER_BWRRDY_Pos)) /* Assigment of value for BWRRDY in the SDHC_NISIER register */
#define   SDHC_NISIER_BWRRDY_MASKED_Val       _UINT16_(0x0)                                        /* (SDHC_NISIER) Masked  */
#define   SDHC_NISIER_BWRRDY_ENABLED_Val      _UINT16_(0x1)                                        /* (SDHC_NISIER) Enabled  */
#define SDHC_NISIER_BWRRDY_MASKED             (SDHC_NISIER_BWRRDY_MASKED_Val << SDHC_NISIER_BWRRDY_Pos) /* (SDHC_NISIER) Masked Position  */
#define SDHC_NISIER_BWRRDY_ENABLED            (SDHC_NISIER_BWRRDY_ENABLED_Val << SDHC_NISIER_BWRRDY_Pos) /* (SDHC_NISIER) Enabled Position  */
#define SDHC_NISIER_BRDRDY_Pos                _UINT16_(5)                                          /* (SDHC_NISIER) Buffer Read Ready Signal Enable Position */
#define SDHC_NISIER_BRDRDY_Msk                (_UINT16_(0x1) << SDHC_NISIER_BRDRDY_Pos)            /* (SDHC_NISIER) Buffer Read Ready Signal Enable Mask */
#define SDHC_NISIER_BRDRDY(value)             (SDHC_NISIER_BRDRDY_Msk & (_UINT16_(value) << SDHC_NISIER_BRDRDY_Pos)) /* Assigment of value for BRDRDY in the SDHC_NISIER register */
#define   SDHC_NISIER_BRDRDY_MASKED_Val       _UINT16_(0x0)                                        /* (SDHC_NISIER) Masked  */
#define   SDHC_NISIER_BRDRDY_ENABLED_Val      _UINT16_(0x1)                                        /* (SDHC_NISIER) Enabled  */
#define SDHC_NISIER_BRDRDY_MASKED             (SDHC_NISIER_BRDRDY_MASKED_Val << SDHC_NISIER_BRDRDY_Pos) /* (SDHC_NISIER) Masked Position  */
#define SDHC_NISIER_BRDRDY_ENABLED            (SDHC_NISIER_BRDRDY_ENABLED_Val << SDHC_NISIER_BRDRDY_Pos) /* (SDHC_NISIER) Enabled Position  */
#define SDHC_NISIER_CINS_Pos                  _UINT16_(6)                                          /* (SDHC_NISIER) Card Insertion Signal Enable Position */
#define SDHC_NISIER_CINS_Msk                  (_UINT16_(0x1) << SDHC_NISIER_CINS_Pos)              /* (SDHC_NISIER) Card Insertion Signal Enable Mask */
#define SDHC_NISIER_CINS(value)               (SDHC_NISIER_CINS_Msk & (_UINT16_(value) << SDHC_NISIER_CINS_Pos)) /* Assigment of value for CINS in the SDHC_NISIER register */
#define   SDHC_NISIER_CINS_MASKED_Val         _UINT16_(0x0)                                        /* (SDHC_NISIER) Masked  */
#define   SDHC_NISIER_CINS_ENABLED_Val        _UINT16_(0x1)                                        /* (SDHC_NISIER) Enabled  */
#define SDHC_NISIER_CINS_MASKED               (SDHC_NISIER_CINS_MASKED_Val << SDHC_NISIER_CINS_Pos) /* (SDHC_NISIER) Masked Position  */
#define SDHC_NISIER_CINS_ENABLED              (SDHC_NISIER_CINS_ENABLED_Val << SDHC_NISIER_CINS_Pos) /* (SDHC_NISIER) Enabled Position  */
#define SDHC_NISIER_CREM_Pos                  _UINT16_(7)                                          /* (SDHC_NISIER) Card Removal Signal Enable Position */
#define SDHC_NISIER_CREM_Msk                  (_UINT16_(0x1) << SDHC_NISIER_CREM_Pos)              /* (SDHC_NISIER) Card Removal Signal Enable Mask */
#define SDHC_NISIER_CREM(value)               (SDHC_NISIER_CREM_Msk & (_UINT16_(value) << SDHC_NISIER_CREM_Pos)) /* Assigment of value for CREM in the SDHC_NISIER register */
#define   SDHC_NISIER_CREM_MASKED_Val         _UINT16_(0x0)                                        /* (SDHC_NISIER) Masked  */
#define   SDHC_NISIER_CREM_ENABLED_Val        _UINT16_(0x1)                                        /* (SDHC_NISIER) Enabled  */
#define SDHC_NISIER_CREM_MASKED               (SDHC_NISIER_CREM_MASKED_Val << SDHC_NISIER_CREM_Pos) /* (SDHC_NISIER) Masked Position  */
#define SDHC_NISIER_CREM_ENABLED              (SDHC_NISIER_CREM_ENABLED_Val << SDHC_NISIER_CREM_Pos) /* (SDHC_NISIER) Enabled Position  */
#define SDHC_NISIER_CINT_Pos                  _UINT16_(8)                                          /* (SDHC_NISIER) Card Interrupt Signal Enable Position */
#define SDHC_NISIER_CINT_Msk                  (_UINT16_(0x1) << SDHC_NISIER_CINT_Pos)              /* (SDHC_NISIER) Card Interrupt Signal Enable Mask */
#define SDHC_NISIER_CINT(value)               (SDHC_NISIER_CINT_Msk & (_UINT16_(value) << SDHC_NISIER_CINT_Pos)) /* Assigment of value for CINT in the SDHC_NISIER register */
#define   SDHC_NISIER_CINT_MASKED_Val         _UINT16_(0x0)                                        /* (SDHC_NISIER) Masked  */
#define   SDHC_NISIER_CINT_ENABLED_Val        _UINT16_(0x1)                                        /* (SDHC_NISIER) Enabled  */
#define SDHC_NISIER_CINT_MASKED               (SDHC_NISIER_CINT_MASKED_Val << SDHC_NISIER_CINT_Pos) /* (SDHC_NISIER) Masked Position  */
#define SDHC_NISIER_CINT_ENABLED              (SDHC_NISIER_CINT_ENABLED_Val << SDHC_NISIER_CINT_Pos) /* (SDHC_NISIER) Enabled Position  */
#define SDHC_NISIER_Msk                       _UINT16_(0x01FF)                                     /* (SDHC_NISIER) Register Mask  */

/* EMMC mode */
#define SDHC_NISIER_EMMC_BOOTAR_Pos           _UINT16_(14)                                         /* (SDHC_NISIER) Boot Acknowledge Received Signal Enable Position */
#define SDHC_NISIER_EMMC_BOOTAR_Msk           (_UINT16_(0x1) << SDHC_NISIER_EMMC_BOOTAR_Pos)       /* (SDHC_NISIER) Boot Acknowledge Received Signal Enable Mask */
#define SDHC_NISIER_EMMC_BOOTAR(value)        (SDHC_NISIER_EMMC_BOOTAR_Msk & (_UINT16_(value) << SDHC_NISIER_EMMC_BOOTAR_Pos))
#define SDHC_NISIER_EMMC_Msk                  _UINT16_(0x4000)                                      /* (SDHC_NISIER_EMMC) Register Mask  */


