Microchip-MPLAB-Harmony/reference_apps/apps/pic32cx_sg61_cult/pic32cx_sg61_getting_started/firmware/src/packs/PIC32CX1025SG61128_DFP/component/sdhc.h
/* -------- SDHC_PCR : (SDHC Offset: 0x29) (R/W 8) Power Control -------- */
#define SDHC_PCR_RESETVALUE                   _UINT8_(0x0E)                                        /*  (SDHC_PCR) Power Control  Reset Value */

#define SDHC_PCR_SDBPWR_Pos                   _UINT8_(0)                                           /* (SDHC_PCR) SD Bus Power Position */
#define SDHC_PCR_SDBPWR_Msk                   (_UINT8_(0x1) << SDHC_PCR_SDBPWR_Pos)                /* (SDHC_PCR) SD Bus Power Mask */
#define SDHC_PCR_SDBPWR(value)                (SDHC_PCR_SDBPWR_Msk & (_UINT8_(value) << SDHC_PCR_SDBPWR_Pos)) /* Assigment of value for SDBPWR in the SDHC_PCR register */
#define   SDHC_PCR_SDBPWR_OFF_Val             _UINT8_(0x0)                                         /* (SDHC_PCR) Power off  */
#define   SDHC_PCR_SDBPWR_ON_Val              _UINT8_(0x1)                                         /* (SDHC_PCR) Power on  */
#define SDHC_PCR_SDBPWR_OFF                   (SDHC_PCR_SDBPWR_OFF_Val << SDHC_PCR_SDBPWR_Pos)     /* (SDHC_PCR) Power off Position  */
#define SDHC_PCR_SDBPWR_ON                    (SDHC_PCR_SDBPWR_ON_Val << SDHC_PCR_SDBPWR_Pos)      /* (SDHC_PCR) Power on Position  */
#define SDHC_PCR_SDBVSEL_Pos                  _UINT8_(1)                                           /* (SDHC_PCR) SD Bus Voltage Select Position */
#define SDHC_PCR_SDBVSEL_Msk                  (_UINT8_(0x7) << SDHC_PCR_SDBVSEL_Pos)               /* (SDHC_PCR) SD Bus Voltage Select Mask */
#define SDHC_PCR_SDBVSEL(value)               (SDHC_PCR_SDBVSEL_Msk & (_UINT8_(value) << SDHC_PCR_SDBVSEL_Pos)) /* Assigment of value for SDBVSEL in the SDHC_PCR register */
#define   SDHC_PCR_SDBVSEL_1V8_Val            _UINT8_(0x5)                                         /* (SDHC_PCR) 1.8V (Typ.)  */
#define   SDHC_PCR_SDBVSEL_3V0_Val            _UINT8_(0x6)                                         /* (SDHC_PCR) 3.0V (Typ.)  */
#define   SDHC_PCR_SDBVSEL_3V3_Val            _UINT8_(0x7)                                         /* (SDHC_PCR) 3.3V (Typ.)  */
#define SDHC_PCR_SDBVSEL_1V8                  (SDHC_PCR_SDBVSEL_1V8_Val << SDHC_PCR_SDBVSEL_Pos)   /* (SDHC_PCR) 1.8V (Typ.) Position  */
#define SDHC_PCR_SDBVSEL_3V0                  (SDHC_PCR_SDBVSEL_3V0_Val << SDHC_PCR_SDBVSEL_Pos)   /* (SDHC_PCR) 3.0V (Typ.) Position  */
#define SDHC_PCR_SDBVSEL_3V3                  (SDHC_PCR_SDBVSEL_3V3_Val << SDHC_PCR_SDBVSEL_Pos)   /* (SDHC_PCR) 3.3V (Typ.) Position  */
#define SDHC_PCR_Msk                          _UINT8_(0x0F)                                        /* (SDHC_PCR) Register Mask  */


/* -------- SDHC_PSR : (SDHC Offset: 0x24) ( R/ 32) Present State -------- */
#define SDHC_PSR_RESETVALUE                   _UINT32_(0xF80000)                                   /*  (SDHC_PSR) Present State  Reset Value */

#define SDHC_PSR_CMDINHC_Pos                  _UINT32_(0)                                          /* (SDHC_PSR) Command Inhibit (CMD) Position */
#define SDHC_PSR_CMDINHC_Msk                  (_UINT32_(0x1) << SDHC_PSR_CMDINHC_Pos)              /* (SDHC_PSR) Command Inhibit (CMD) Mask */
#define SDHC_PSR_CMDINHC(value)               (SDHC_PSR_CMDINHC_Msk & (_UINT32_(value) << SDHC_PSR_CMDINHC_Pos)) /* Assigment of value for CMDINHC in the SDHC_PSR register */
#define   SDHC_PSR_CMDINHC_CAN_Val            _UINT32_(0x0)                                        /* (SDHC_PSR) Can issue command using only CMD line  */
#define   SDHC_PSR_CMDINHC_CANNOT_Val         _UINT32_(0x1)                                        /* (SDHC_PSR) Cannot issue command  */
#define SDHC_PSR_CMDINHC_CAN                  (SDHC_PSR_CMDINHC_CAN_Val << SDHC_PSR_CMDINHC_Pos)   /* (SDHC_PSR) Can issue command using only CMD line Position  */
#define SDHC_PSR_CMDINHC_CANNOT               (SDHC_PSR_CMDINHC_CANNOT_Val << SDHC_PSR_CMDINHC_Pos) /* (SDHC_PSR) Cannot issue command Position  */
#define SDHC_PSR_CMDINHD_Pos                  _UINT32_(1)                                          /* (SDHC_PSR) Command Inhibit (DAT) Position */
#define SDHC_PSR_CMDINHD_Msk                  (_UINT32_(0x1) << SDHC_PSR_CMDINHD_Pos)              /* (SDHC_PSR) Command Inhibit (DAT) Mask */
#define SDHC_PSR_CMDINHD(value)               (SDHC_PSR_CMDINHD_Msk & (_UINT32_(value) << SDHC_PSR_CMDINHD_Pos)) /* Assigment of value for CMDINHD in the SDHC_PSR register */
#define   SDHC_PSR_CMDINHD_CAN_Val            _UINT32_(0x0)                                        /* (SDHC_PSR) Can issue command which uses the DAT line  */
#define   SDHC_PSR_CMDINHD_CANNOT_Val         _UINT32_(0x1)                                        /* (SDHC_PSR) Cannot issue command which uses the DAT line  */
#define SDHC_PSR_CMDINHD_CAN                  (SDHC_PSR_CMDINHD_CAN_Val << SDHC_PSR_CMDINHD_Pos)   /* (SDHC_PSR) Can issue command which uses the DAT line Position  */
#define SDHC_PSR_CMDINHD_CANNOT               (SDHC_PSR_CMDINHD_CANNOT_Val << SDHC_PSR_CMDINHD_Pos) /* (SDHC_PSR) Cannot issue command which uses the DAT line Position  */
#define SDHC_PSR_DLACT_Pos                    _UINT32_(2)                                          /* (SDHC_PSR) DAT Line Active Position */
#define SDHC_PSR_DLACT_Msk                    (_UINT32_(0x1) << SDHC_PSR_DLACT_Pos)                /* (SDHC_PSR) DAT Line Active Mask */
#define SDHC_PSR_DLACT(value)                 (SDHC_PSR_DLACT_Msk & (_UINT32_(value) << SDHC_PSR_DLACT_Pos)) /* Assigment of value for DLACT in the SDHC_PSR register */
#define   SDHC_PSR_DLACT_INACTIVE_Val         _UINT32_(0x0)                                        /* (SDHC_PSR) DAT Line Inactive  */
#define   SDHC_PSR_DLACT_ACTIVE_Val           _UINT32_(0x1)                                        /* (SDHC_PSR) DAT Line Active  */
#define SDHC_PSR_DLACT_INACTIVE               (SDHC_PSR_DLACT_INACTIVE_Val << SDHC_PSR_DLACT_Pos)  /* (SDHC_PSR) DAT Line Inactive Position  */
#define SDHC_PSR_DLACT_ACTIVE                 (SDHC_PSR_DLACT_ACTIVE_Val << SDHC_PSR_DLACT_Pos)    /* (SDHC_PSR) DAT Line Active Position  */
#define SDHC_PSR_RTREQ_Pos                    _UINT32_(3)                                          /* (SDHC_PSR) Re-Tuning Request Position */
#define SDHC_PSR_RTREQ_Msk                    (_UINT32_(0x1) << SDHC_PSR_RTREQ_Pos)                /* (SDHC_PSR) Re-Tuning Request Mask */
#define SDHC_PSR_RTREQ(value)                 (SDHC_PSR_RTREQ_Msk & (_UINT32_(value) << SDHC_PSR_RTREQ_Pos)) /* Assigment of value for RTREQ in the SDHC_PSR register */
#define   SDHC_PSR_RTREQ_OK_Val               _UINT32_(0x0)                                        /* (SDHC_PSR) Fixed or well-tuned sampling clock  */
#define   SDHC_PSR_RTREQ_REQUIRED_Val         _UINT32_(0x1)                                        /* (SDHC_PSR) Sampling clock needs re-tuning  */
#define SDHC_PSR_RTREQ_OK                     (SDHC_PSR_RTREQ_OK_Val << SDHC_PSR_RTREQ_Pos)        /* (SDHC_PSR) Fixed or well-tuned sampling clock Position  */
#define SDHC_PSR_RTREQ_REQUIRED               (SDHC_PSR_RTREQ_REQUIRED_Val << SDHC_PSR_RTREQ_Pos)  /* (SDHC_PSR) Sampling clock needs re-tuning Position  */
#define SDHC_PSR_WTACT_Pos                    _UINT32_(8)                                          /* (SDHC_PSR) Write Transfer Active Position */
#define SDHC_PSR_WTACT_Msk                    (_UINT32_(0x1) << SDHC_PSR_WTACT_Pos)                /* (SDHC_PSR) Write Transfer Active Mask */
#define SDHC_PSR_WTACT(value)                 (SDHC_PSR_WTACT_Msk & (_UINT32_(value) << SDHC_PSR_WTACT_Pos)) /* Assigment of value for WTACT in the SDHC_PSR register */
#define   SDHC_PSR_WTACT_NO_Val               _UINT32_(0x0)                                        /* (SDHC_PSR) No valid data  */
#define   SDHC_PSR_WTACT_YES_Val              _UINT32_(0x1)                                        /* (SDHC_PSR) Transferring data  */
#define SDHC_PSR_WTACT_NO                     (SDHC_PSR_WTACT_NO_Val << SDHC_PSR_WTACT_Pos)        /* (SDHC_PSR) No valid data Position  */
#define SDHC_PSR_WTACT_YES                    (SDHC_PSR_WTACT_YES_Val << SDHC_PSR_WTACT_Pos)       /* (SDHC_PSR) Transferring data Position  */
#define SDHC_PSR_RTACT_Pos                    _UINT32_(9)                                          /* (SDHC_PSR) Read Transfer Active Position */
#define SDHC_PSR_RTACT_Msk                    (_UINT32_(0x1) << SDHC_PSR_RTACT_Pos)                /* (SDHC_PSR) Read Transfer Active Mask */
#define SDHC_PSR_RTACT(value)                 (SDHC_PSR_RTACT_Msk & (_UINT32_(value) << SDHC_PSR_RTACT_Pos)) /* Assigment of value for RTACT in the SDHC_PSR register */
#define   SDHC_PSR_RTACT_NO_Val               _UINT32_(0x0)                                        /* (SDHC_PSR) No valid data  */
#define   SDHC_PSR_RTACT_YES_Val              _UINT32_(0x1)                                        /* (SDHC_PSR) Transferring data  */
#define SDHC_PSR_RTACT_NO                     (SDHC_PSR_RTACT_NO_Val << SDHC_PSR_RTACT_Pos)        /* (SDHC_PSR) No valid data Position  */
#define SDHC_PSR_RTACT_YES                    (SDHC_PSR_RTACT_YES_Val << SDHC_PSR_RTACT_Pos)       /* (SDHC_PSR) Transferring data Position  */
#define SDHC_PSR_BUFWREN_Pos                  _UINT32_(10)                                         /* (SDHC_PSR) Buffer Write Enable Position */
#define SDHC_PSR_BUFWREN_Msk                  (_UINT32_(0x1) << SDHC_PSR_BUFWREN_Pos)              /* (SDHC_PSR) Buffer Write Enable Mask */
#define SDHC_PSR_BUFWREN(value)               (SDHC_PSR_BUFWREN_Msk & (_UINT32_(value) << SDHC_PSR_BUFWREN_Pos)) /* Assigment of value for BUFWREN in the SDHC_PSR register */
#define   SDHC_PSR_BUFWREN_DISABLE_Val        _UINT32_(0x0)                                        /* (SDHC_PSR) Write disable  */
#define   SDHC_PSR_BUFWREN_ENABLE_Val         _UINT32_(0x1)                                        /* (SDHC_PSR) Write enable  */
#define SDHC_PSR_BUFWREN_DISABLE              (SDHC_PSR_BUFWREN_DISABLE_Val << SDHC_PSR_BUFWREN_Pos) /* (SDHC_PSR) Write disable Position  */
#define SDHC_PSR_BUFWREN_ENABLE               (SDHC_PSR_BUFWREN_ENABLE_Val << SDHC_PSR_BUFWREN_Pos) /* (SDHC_PSR) Write enable Position  */
#define SDHC_PSR_BUFRDEN_Pos                  _UINT32_(11)                                         /* (SDHC_PSR) Buffer Read Enable Position */
#define SDHC_PSR_BUFRDEN_Msk                  (_UINT32_(0x1) << SDHC_PSR_BUFRDEN_Pos)              /* (SDHC_PSR) Buffer Read Enable Mask */
#define SDHC_PSR_BUFRDEN(value)               (SDHC_PSR_BUFRDEN_Msk & (_UINT32_(value) << SDHC_PSR_BUFRDEN_Pos)) /* Assigment of value for BUFRDEN in the SDHC_PSR register */
#define   SDHC_PSR_BUFRDEN_DISABLE_Val        _UINT32_(0x0)                                        /* (SDHC_PSR) Read disable  */
#define   SDHC_PSR_BUFRDEN_ENABLE_Val         _UINT32_(0x1)                                        /* (SDHC_PSR) Read enable  */
#define SDHC_PSR_BUFRDEN_DISABLE              (SDHC_PSR_BUFRDEN_DISABLE_Val << SDHC_PSR_BUFRDEN_Pos) /* (SDHC_PSR) Read disable Position  */
#define SDHC_PSR_BUFRDEN_ENABLE               (SDHC_PSR_BUFRDEN_ENABLE_Val << SDHC_PSR_BUFRDEN_Pos) /* (SDHC_PSR) Read enable Position  */
#define SDHC_PSR_CARDINS_Pos                  _UINT32_(16)                                         /* (SDHC_PSR) Card Inserted Position */
#define SDHC_PSR_CARDINS_Msk                  (_UINT32_(0x1) << SDHC_PSR_CARDINS_Pos)              /* (SDHC_PSR) Card Inserted Mask */
#define SDHC_PSR_CARDINS(value)               (SDHC_PSR_CARDINS_Msk & (_UINT32_(value) << SDHC_PSR_CARDINS_Pos)) /* Assigment of value for CARDINS in the SDHC_PSR register */
#define   SDHC_PSR_CARDINS_NO_Val             _UINT32_(0x0)                                        /* (SDHC_PSR) Reset or Debouncing or No Card  */
#define   SDHC_PSR_CARDINS_YES_Val            _UINT32_(0x1)                                        /* (SDHC_PSR) Card inserted  */
#define SDHC_PSR_CARDINS_NO                   (SDHC_PSR_CARDINS_NO_Val << SDHC_PSR_CARDINS_Pos)    /* (SDHC_PSR) Reset or Debouncing or No Card Position  */
#define SDHC_PSR_CARDINS_YES                  (SDHC_PSR_CARDINS_YES_Val << SDHC_PSR_CARDINS_Pos)   /* (SDHC_PSR) Card inserted Position  */
#define SDHC_PSR_CARDSS_Pos                   _UINT32_(17)                                         /* (SDHC_PSR) Card State Stable Position */
#define SDHC_PSR_CARDSS_Msk                   (_UINT32_(0x1) << SDHC_PSR_CARDSS_Pos)               /* (SDHC_PSR) Card State Stable Mask */
#define SDHC_PSR_CARDSS(value)                (SDHC_PSR_CARDSS_Msk & (_UINT32_(value) << SDHC_PSR_CARDSS_Pos)) /* Assigment of value for CARDSS in the SDHC_PSR register */
#define   SDHC_PSR_CARDSS_NO_Val              _UINT32_(0x0)                                        /* (SDHC_PSR) Reset or Debouncing  */
#define   SDHC_PSR_CARDSS_YES_Val             _UINT32_(0x1)                                        /* (SDHC_PSR) No Card or Insered  */
#define SDHC_PSR_CARDSS_NO                    (SDHC_PSR_CARDSS_NO_Val << SDHC_PSR_CARDSS_Pos)      /* (SDHC_PSR) Reset or Debouncing Position  */
#define SDHC_PSR_CARDSS_YES                   (SDHC_PSR_CARDSS_YES_Val << SDHC_PSR_CARDSS_Pos)     /* (SDHC_PSR) No Card or Insered Position  */
#define SDHC_PSR_CARDDPL_Pos                  _UINT32_(18)                                         /* (SDHC_PSR) Card Detect Pin Level Position */
#define SDHC_PSR_CARDDPL_Msk                  (_UINT32_(0x1) << SDHC_PSR_CARDDPL_Pos)              /* (SDHC_PSR) Card Detect Pin Level Mask */
#define SDHC_PSR_CARDDPL(value)               (SDHC_PSR_CARDDPL_Msk & (_UINT32_(value) << SDHC_PSR_CARDDPL_Pos)) /* Assigment of value for CARDDPL in the SDHC_PSR register */
#define   SDHC_PSR_CARDDPL_NO_Val             _UINT32_(0x0)                                        /* (SDHC_PSR) No card present (SDCD#=1)  */
#define   SDHC_PSR_CARDDPL_YES_Val            _UINT32_(0x1)                                        /* (SDHC_PSR) Card present (SDCD#=0)  */
#define SDHC_PSR_CARDDPL_NO                   (SDHC_PSR_CARDDPL_NO_Val << SDHC_PSR_CARDDPL_Pos)    /* (SDHC_PSR) No card present (SDCD#=1) Position  */
#define SDHC_PSR_CARDDPL_YES                  (SDHC_PSR_CARDDPL_YES_Val << SDHC_PSR_CARDDPL_Pos)   /* (SDHC_PSR) Card present (SDCD#=0) Position  */
#define SDHC_PSR_WRPPL_Pos                    _UINT32_(19)                                         /* (SDHC_PSR) Write Protect Pin Level Position */
#define SDHC_PSR_WRPPL_Msk                    (_UINT32_(0x1) << SDHC_PSR_WRPPL_Pos)                /* (SDHC_PSR) Write Protect Pin Level Mask */
#define SDHC_PSR_WRPPL(value)                 (SDHC_PSR_WRPPL_Msk & (_UINT32_(value) << SDHC_PSR_WRPPL_Pos)) /* Assigment of value for WRPPL in the SDHC_PSR register */
#define   SDHC_PSR_WRPPL_PROTECTED_Val        _UINT32_(0x0)                                        /* (SDHC_PSR) Write protected (SDWP#=0)  */
#define   SDHC_PSR_WRPPL_ENABLED_Val          _UINT32_(0x1)                                        /* (SDHC_PSR) Write enabled (SDWP#=1)  */
#define SDHC_PSR_WRPPL_PROTECTED              (SDHC_PSR_WRPPL_PROTECTED_Val << SDHC_PSR_WRPPL_Pos) /* (SDHC_PSR) Write protected (SDWP#=0) Position  */
#define SDHC_PSR_WRPPL_ENABLED                (SDHC_PSR_WRPPL_ENABLED_Val << SDHC_PSR_WRPPL_Pos)   /* (SDHC_PSR) Write enabled (SDWP#=1) Position  */
#define SDHC_PSR_DATLL_Pos                    _UINT32_(20)                                         /* (SDHC_PSR) DAT[3:0] Line Level Position */
#define SDHC_PSR_DATLL_Msk                    (_UINT32_(0xF) << SDHC_PSR_DATLL_Pos)                /* (SDHC_PSR) DAT[3:0] Line Level Mask */
#define SDHC_PSR_DATLL(value)                 (SDHC_PSR_DATLL_Msk & (_UINT32_(value) << SDHC_PSR_DATLL_Pos)) /* Assigment of value for DATLL in the SDHC_PSR register */
#define SDHC_PSR_CMDLL_Pos                    _UINT32_(24)                                         /* (SDHC_PSR) CMD Line Level Position */
#define SDHC_PSR_CMDLL_Msk                    (_UINT32_(0x1) << SDHC_PSR_CMDLL_Pos)                /* (SDHC_PSR) CMD Line Level Mask */
#define SDHC_PSR_CMDLL(value)                 (SDHC_PSR_CMDLL_Msk & (_UINT32_(value) << SDHC_PSR_CMDLL_Pos)) /* Assigment of value for CMDLL in the SDHC_PSR register */
#define SDHC_PSR_Msk                          _UINT32_(0x01FF0F0F)                                 /* (SDHC_PSR) Register Mask  */


/* -------- SDHC_PVR : (SDHC Offset: 0x60) (R/W 16) Preset Value n -------- */
#define SDHC_PVR_RESETVALUE                   _UINT16_(0x00)                                       /*  (SDHC_PVR) Preset Value n  Reset Value */

#define SDHC_PVR_SDCLKFSEL_Pos                _UINT16_(0)                                          /* (SDHC_PVR) SDCLK Frequency Select Value for Initialization Position */
#define SDHC_PVR_SDCLKFSEL_Msk                (_UINT16_(0x3FF) << SDHC_PVR_SDCLKFSEL_Pos)          /* (SDHC_PVR) SDCLK Frequency Select Value for Initialization Mask */
#define SDHC_PVR_SDCLKFSEL(value)             (SDHC_PVR_SDCLKFSEL_Msk & (_UINT16_(value) << SDHC_PVR_SDCLKFSEL_Pos)) /* Assigment of value for SDCLKFSEL in the SDHC_PVR register */
#define SDHC_PVR_CLKGSEL_Pos                  _UINT16_(10)                                         /* (SDHC_PVR) Clock Generator Select Value for Initialization Position */
#define SDHC_PVR_CLKGSEL_Msk                  (_UINT16_(0x1) << SDHC_PVR_CLKGSEL_Pos)              /* (SDHC_PVR) Clock Generator Select Value for Initialization Mask */
#define SDHC_PVR_CLKGSEL(value)               (SDHC_PVR_CLKGSEL_Msk & (_UINT16_(value) << SDHC_PVR_CLKGSEL_Pos)) /* Assigment of value for CLKGSEL in the SDHC_PVR register */
#define   SDHC_PVR_CLKGSEL_DIV_Val            _UINT16_(0x0)                                        /* (SDHC_PVR) Host Controller Ver2.00 Compatible Clock Generator (Divider)  */
#define   SDHC_PVR_CLKGSEL_PROG_Val           _UINT16_(0x1)                                        /* (SDHC_PVR) Programmable Clock Generator  */
#define SDHC_PVR_CLKGSEL_DIV                  (SDHC_PVR_CLKGSEL_DIV_Val << SDHC_PVR_CLKGSEL_Pos)   /* (SDHC_PVR) Host Controller Ver2.00 Compatible Clock Generator (Divider) Position  */
#define SDHC_PVR_CLKGSEL_PROG                 (SDHC_PVR_CLKGSEL_PROG_Val << SDHC_PVR_CLKGSEL_Pos)  /* (SDHC_PVR) Programmable Clock Generator Position  */
#define SDHC_PVR_DRVSEL_Pos                   _UINT16_(14)                                         /* (SDHC_PVR) Driver Strength Select Value for Initialization Position */
#define SDHC_PVR_DRVSEL_Msk                   (_UINT16_(0x3) << SDHC_PVR_DRVSEL_Pos)               /* (SDHC_PVR) Driver Strength Select Value for Initialization Mask */
#define SDHC_PVR_DRVSEL(value)                (SDHC_PVR_DRVSEL_Msk & (_UINT16_(value) << SDHC_PVR_DRVSEL_Pos)) /* Assigment of value for DRVSEL in the SDHC_PVR register */
#define   SDHC_PVR_DRVSEL_B_Val               _UINT16_(0x0)                                        /* (SDHC_PVR) Driver Type B is Selected  */
#define   SDHC_PVR_DRVSEL_A_Val               _UINT16_(0x1)                                        /* (SDHC_PVR) Driver Type A is Selected  */
#define   SDHC_PVR_DRVSEL_C_Val               _UINT16_(0x2)                                        /* (SDHC_PVR) Driver Type C is Selected  */
#define   SDHC_PVR_DRVSEL_D_Val               _UINT16_(0x3)                                        /* (SDHC_PVR) Driver Type D is Selected  */
#define SDHC_PVR_DRVSEL_B                     (SDHC_PVR_DRVSEL_B_Val << SDHC_PVR_DRVSEL_Pos)       /* (SDHC_PVR) Driver Type B is Selected Position  */
#define SDHC_PVR_DRVSEL_A                     (SDHC_PVR_DRVSEL_A_Val << SDHC_PVR_DRVSEL_Pos)       /* (SDHC_PVR) Driver Type A is Selected Position  */
#define SDHC_PVR_DRVSEL_C                     (SDHC_PVR_DRVSEL_C_Val << SDHC_PVR_DRVSEL_Pos)       /* (SDHC_PVR) Driver Type C is Selected Position  */
#define SDHC_PVR_DRVSEL_D                     (SDHC_PVR_DRVSEL_D_Val << SDHC_PVR_DRVSEL_Pos)       /* (SDHC_PVR) Driver Type D is Selected Position  */
#define SDHC_PVR_Msk                          _UINT16_(0xC7FF)                                     /* (SDHC_PVR) Register Mask  */


/* -------- SDHC_RR : (SDHC Offset: 0x10) ( R/ 32) Response -------- */
#define SDHC_RR_RESETVALUE                    _UINT32_(0x00)                                       /*  (SDHC_RR) Response  Reset Value */

#define SDHC_RR_CMDRESP_Pos                   _UINT32_(0)                                          /* (SDHC_RR) Command Response Position */
#define SDHC_RR_CMDRESP_Msk                   (_UINT32_(0xFFFFFFFF) << SDHC_RR_CMDRESP_Pos)        /* (SDHC_RR) Command Response Mask */
#define SDHC_RR_CMDRESP(value)                (SDHC_RR_CMDRESP_Msk & (_UINT32_(value) << SDHC_RR_CMDRESP_Pos)) /* Assigment of value for CMDRESP in the SDHC_RR register */
#define SDHC_RR_Msk                           _UINT32_(0xFFFFFFFF)                                 /* (SDHC_RR) Register Mask  */


/* -------- SDHC_SISR : (SDHC Offset: 0xFC) ( R/ 16) Slot Interrupt Status -------- */
#define SDHC_SISR_RESETVALUE                  _UINT16_(0x00)                                       /*  (SDHC_SISR) Slot Interrupt Status  Reset Value */

#define SDHC_SISR_INTSSL_Pos                  _UINT16_(0)                                          /* (SDHC_SISR) Interrupt Signal for Each SDHC Slot Position */
#define SDHC_SISR_INTSSL_Msk                  (_UINT16_(0x3) << SDHC_SISR_INTSSL_Pos)              /* (SDHC_SISR) Interrupt Signal for Each SDHC Slot Mask */
#define SDHC_SISR_INTSSL(value)               (SDHC_SISR_INTSSL_Msk & (_UINT16_(value) << SDHC_SISR_INTSSL_Pos)) /* Assigment of value for INTSSL in the SDHC_SISR register */
#define SDHC_SISR_Msk                         _UINT16_(0x0003)                                     /* (SDHC_SISR) Register Mask  */


/* -------- SDHC_SRR : (SDHC Offset: 0x2F) (R/W 8) Software Reset -------- */
#define SDHC_SRR_RESETVALUE                   _UINT8_(0x00)                                        /*  (SDHC_SRR) Software Reset  Reset Value */

