Microchip-MPLAB-Harmony/reference_apps/apps/pic32cx_sg61_cult/pic32cx_sg61_getting_started/firmware/src/packs/PIC32CX1025SG61128_DFP/component/sdhc.h
#define SDHC_SRR_SWRSTALL_Pos                 _UINT8_(0)                                           /* (SDHC_SRR) Software Reset For All Position */
#define SDHC_SRR_SWRSTALL_Msk                 (_UINT8_(0x1) << SDHC_SRR_SWRSTALL_Pos)              /* (SDHC_SRR) Software Reset For All Mask */
#define SDHC_SRR_SWRSTALL(value)              (SDHC_SRR_SWRSTALL_Msk & (_UINT8_(value) << SDHC_SRR_SWRSTALL_Pos)) /* Assigment of value for SWRSTALL in the SDHC_SRR register */
#define   SDHC_SRR_SWRSTALL_WORK_Val          _UINT8_(0x0)                                         /* (SDHC_SRR) Work  */
#define   SDHC_SRR_SWRSTALL_RESET_Val         _UINT8_(0x1)                                         /* (SDHC_SRR) Reset  */
#define SDHC_SRR_SWRSTALL_WORK                (SDHC_SRR_SWRSTALL_WORK_Val << SDHC_SRR_SWRSTALL_Pos) /* (SDHC_SRR) Work Position  */
#define SDHC_SRR_SWRSTALL_RESET               (SDHC_SRR_SWRSTALL_RESET_Val << SDHC_SRR_SWRSTALL_Pos) /* (SDHC_SRR) Reset Position  */
#define SDHC_SRR_SWRSTCMD_Pos                 _UINT8_(1)                                           /* (SDHC_SRR) Software Reset For CMD Line Position */
#define SDHC_SRR_SWRSTCMD_Msk                 (_UINT8_(0x1) << SDHC_SRR_SWRSTCMD_Pos)              /* (SDHC_SRR) Software Reset For CMD Line Mask */
#define SDHC_SRR_SWRSTCMD(value)              (SDHC_SRR_SWRSTCMD_Msk & (_UINT8_(value) << SDHC_SRR_SWRSTCMD_Pos)) /* Assigment of value for SWRSTCMD in the SDHC_SRR register */
#define   SDHC_SRR_SWRSTCMD_WORK_Val          _UINT8_(0x0)                                         /* (SDHC_SRR) Work  */
#define   SDHC_SRR_SWRSTCMD_RESET_Val         _UINT8_(0x1)                                         /* (SDHC_SRR) Reset  */
#define SDHC_SRR_SWRSTCMD_WORK                (SDHC_SRR_SWRSTCMD_WORK_Val << SDHC_SRR_SWRSTCMD_Pos) /* (SDHC_SRR) Work Position  */
#define SDHC_SRR_SWRSTCMD_RESET               (SDHC_SRR_SWRSTCMD_RESET_Val << SDHC_SRR_SWRSTCMD_Pos) /* (SDHC_SRR) Reset Position  */
#define SDHC_SRR_SWRSTDAT_Pos                 _UINT8_(2)                                           /* (SDHC_SRR) Software Reset For DAT Line Position */
#define SDHC_SRR_SWRSTDAT_Msk                 (_UINT8_(0x1) << SDHC_SRR_SWRSTDAT_Pos)              /* (SDHC_SRR) Software Reset For DAT Line Mask */
#define SDHC_SRR_SWRSTDAT(value)              (SDHC_SRR_SWRSTDAT_Msk & (_UINT8_(value) << SDHC_SRR_SWRSTDAT_Pos)) /* Assigment of value for SWRSTDAT in the SDHC_SRR register */
#define   SDHC_SRR_SWRSTDAT_WORK_Val          _UINT8_(0x0)                                         /* (SDHC_SRR) Work  */
#define   SDHC_SRR_SWRSTDAT_RESET_Val         _UINT8_(0x1)                                         /* (SDHC_SRR) Reset  */
#define SDHC_SRR_SWRSTDAT_WORK                (SDHC_SRR_SWRSTDAT_WORK_Val << SDHC_SRR_SWRSTDAT_Pos) /* (SDHC_SRR) Work Position  */
#define SDHC_SRR_SWRSTDAT_RESET               (SDHC_SRR_SWRSTDAT_RESET_Val << SDHC_SRR_SWRSTDAT_Pos) /* (SDHC_SRR) Reset Position  */
#define SDHC_SRR_Msk                          _UINT8_(0x07)                                        /* (SDHC_SRR) Register Mask  */


/* -------- SDHC_SSAR : (SDHC Offset: 0x00) (R/W 32) SDMA System Address / Argument 2 -------- */
#define SDHC_SSAR_RESETVALUE                  _UINT32_(0x00)                                       /*  (SDHC_SSAR) SDMA System Address / Argument 2  Reset Value */

#define SDHC_SSAR_ADDR_Pos                    _UINT32_(0)                                          /* (SDHC_SSAR) SDMA System Address Position */
#define SDHC_SSAR_ADDR_Msk                    (_UINT32_(0xFFFFFFFF) << SDHC_SSAR_ADDR_Pos)         /* (SDHC_SSAR) SDMA System Address Mask */
#define SDHC_SSAR_ADDR(value)                 (SDHC_SSAR_ADDR_Msk & (_UINT32_(value) << SDHC_SSAR_ADDR_Pos)) /* Assigment of value for ADDR in the SDHC_SSAR register */
#define SDHC_SSAR_Msk                         _UINT32_(0xFFFFFFFF)                                 /* (SDHC_SSAR) Register Mask  */

/* CMD23 mode */
#define SDHC_SSAR_CMD23_ARG2_Pos              _UINT32_(0)                                          /* (SDHC_SSAR) Argument 2 Position */
#define SDHC_SSAR_CMD23_ARG2_Msk              (_UINT32_(0xFFFFFFFF) << SDHC_SSAR_CMD23_ARG2_Pos)   /* (SDHC_SSAR) Argument 2 Mask */
#define SDHC_SSAR_CMD23_ARG2(value)           (SDHC_SSAR_CMD23_ARG2_Msk & (_UINT32_(value) << SDHC_SSAR_CMD23_ARG2_Pos))
#define SDHC_SSAR_CMD23_Msk                   _UINT32_(0xFFFFFFFF)                                  /* (SDHC_SSAR_CMD23) Register Mask  */


/* -------- SDHC_TCR : (SDHC Offset: 0x2E) (R/W 8) Timeout Control -------- */
#define SDHC_TCR_RESETVALUE                   _UINT8_(0x00)                                        /*  (SDHC_TCR) Timeout Control  Reset Value */

#define SDHC_TCR_DTCVAL_Pos                   _UINT8_(0)                                           /* (SDHC_TCR) Data Timeout Counter Value Position */
#define SDHC_TCR_DTCVAL_Msk                   (_UINT8_(0xF) << SDHC_TCR_DTCVAL_Pos)                /* (SDHC_TCR) Data Timeout Counter Value Mask */
#define SDHC_TCR_DTCVAL(value)                (SDHC_TCR_DTCVAL_Msk & (_UINT8_(value) << SDHC_TCR_DTCVAL_Pos)) /* Assigment of value for DTCVAL in the SDHC_TCR register */
#define SDHC_TCR_Msk                          _UINT8_(0x0F)                                        /* (SDHC_TCR) Register Mask  */


/* -------- SDHC_TMR : (SDHC Offset: 0x0C) (R/W 16) Transfer Mode -------- */
#define SDHC_TMR_RESETVALUE                   _UINT16_(0x00)                                       /*  (SDHC_TMR) Transfer Mode  Reset Value */

#define SDHC_TMR_DMAEN_Pos                    _UINT16_(0)                                          /* (SDHC_TMR) DMA Enable Position */
#define SDHC_TMR_DMAEN_Msk                    (_UINT16_(0x1) << SDHC_TMR_DMAEN_Pos)                /* (SDHC_TMR) DMA Enable Mask */
#define SDHC_TMR_DMAEN(value)                 (SDHC_TMR_DMAEN_Msk & (_UINT16_(value) << SDHC_TMR_DMAEN_Pos)) /* Assigment of value for DMAEN in the SDHC_TMR register */
#define   SDHC_TMR_DMAEN_DISABLE_Val          _UINT16_(0x0)                                        /* (SDHC_TMR) No data transfer or Non DMA data transfer  */
#define   SDHC_TMR_DMAEN_ENABLE_Val           _UINT16_(0x1)                                        /* (SDHC_TMR) DMA data transfer  */
#define SDHC_TMR_DMAEN_DISABLE                (SDHC_TMR_DMAEN_DISABLE_Val << SDHC_TMR_DMAEN_Pos)   /* (SDHC_TMR) No data transfer or Non DMA data transfer Position  */
#define SDHC_TMR_DMAEN_ENABLE                 (SDHC_TMR_DMAEN_ENABLE_Val << SDHC_TMR_DMAEN_Pos)    /* (SDHC_TMR) DMA data transfer Position  */
#define SDHC_TMR_BCEN_Pos                     _UINT16_(1)                                          /* (SDHC_TMR) Block Count Enable Position */
#define SDHC_TMR_BCEN_Msk                     (_UINT16_(0x1) << SDHC_TMR_BCEN_Pos)                 /* (SDHC_TMR) Block Count Enable Mask */
#define SDHC_TMR_BCEN(value)                  (SDHC_TMR_BCEN_Msk & (_UINT16_(value) << SDHC_TMR_BCEN_Pos)) /* Assigment of value for BCEN in the SDHC_TMR register */
#define   SDHC_TMR_BCEN_DISABLE_Val           _UINT16_(0x0)                                        /* (SDHC_TMR) Disable  */
#define   SDHC_TMR_BCEN_ENABLE_Val            _UINT16_(0x1)                                        /* (SDHC_TMR) Enable  */
#define SDHC_TMR_BCEN_DISABLE                 (SDHC_TMR_BCEN_DISABLE_Val << SDHC_TMR_BCEN_Pos)     /* (SDHC_TMR) Disable Position  */
#define SDHC_TMR_BCEN_ENABLE                  (SDHC_TMR_BCEN_ENABLE_Val << SDHC_TMR_BCEN_Pos)      /* (SDHC_TMR) Enable Position  */
#define SDHC_TMR_ACMDEN_Pos                   _UINT16_(2)                                          /* (SDHC_TMR) Auto Command Enable Position */
#define SDHC_TMR_ACMDEN_Msk                   (_UINT16_(0x3) << SDHC_TMR_ACMDEN_Pos)               /* (SDHC_TMR) Auto Command Enable Mask */
#define SDHC_TMR_ACMDEN(value)                (SDHC_TMR_ACMDEN_Msk & (_UINT16_(value) << SDHC_TMR_ACMDEN_Pos)) /* Assigment of value for ACMDEN in the SDHC_TMR register */
#define   SDHC_TMR_ACMDEN_DISABLED_Val        _UINT16_(0x0)                                        /* (SDHC_TMR) Auto Command Disabled  */
#define   SDHC_TMR_ACMDEN_CMD12_Val           _UINT16_(0x1)                                        /* (SDHC_TMR) Auto CMD12 Enable  */
#define   SDHC_TMR_ACMDEN_CMD23_Val           _UINT16_(0x2)                                        /* (SDHC_TMR) Auto CMD23 Enable  */
#define SDHC_TMR_ACMDEN_DISABLED              (SDHC_TMR_ACMDEN_DISABLED_Val << SDHC_TMR_ACMDEN_Pos) /* (SDHC_TMR) Auto Command Disabled Position  */
#define SDHC_TMR_ACMDEN_CMD12                 (SDHC_TMR_ACMDEN_CMD12_Val << SDHC_TMR_ACMDEN_Pos)   /* (SDHC_TMR) Auto CMD12 Enable Position  */
#define SDHC_TMR_ACMDEN_CMD23                 (SDHC_TMR_ACMDEN_CMD23_Val << SDHC_TMR_ACMDEN_Pos)   /* (SDHC_TMR) Auto CMD23 Enable Position  */
#define SDHC_TMR_DTDSEL_Pos                   _UINT16_(4)                                          /* (SDHC_TMR) Data Transfer Direction Selection Position */
#define SDHC_TMR_DTDSEL_Msk                   (_UINT16_(0x1) << SDHC_TMR_DTDSEL_Pos)               /* (SDHC_TMR) Data Transfer Direction Selection Mask */
#define SDHC_TMR_DTDSEL(value)                (SDHC_TMR_DTDSEL_Msk & (_UINT16_(value) << SDHC_TMR_DTDSEL_Pos)) /* Assigment of value for DTDSEL in the SDHC_TMR register */
#define   SDHC_TMR_DTDSEL_WRITE_Val           _UINT16_(0x0)                                        /* (SDHC_TMR) Write (Host to Card)  */
#define   SDHC_TMR_DTDSEL_READ_Val            _UINT16_(0x1)                                        /* (SDHC_TMR) Read (Card to Host)  */
#define SDHC_TMR_DTDSEL_WRITE                 (SDHC_TMR_DTDSEL_WRITE_Val << SDHC_TMR_DTDSEL_Pos)   /* (SDHC_TMR) Write (Host to Card) Position  */
#define SDHC_TMR_DTDSEL_READ                  (SDHC_TMR_DTDSEL_READ_Val << SDHC_TMR_DTDSEL_Pos)    /* (SDHC_TMR) Read (Card to Host) Position  */
#define SDHC_TMR_MSBSEL_Pos                   _UINT16_(5)                                          /* (SDHC_TMR) Multi/Single Block Selection Position */
#define SDHC_TMR_MSBSEL_Msk                   (_UINT16_(0x1) << SDHC_TMR_MSBSEL_Pos)               /* (SDHC_TMR) Multi/Single Block Selection Mask */
#define SDHC_TMR_MSBSEL(value)                (SDHC_TMR_MSBSEL_Msk & (_UINT16_(value) << SDHC_TMR_MSBSEL_Pos)) /* Assigment of value for MSBSEL in the SDHC_TMR register */
#define   SDHC_TMR_MSBSEL_SINGLE_Val          _UINT16_(0x0)                                        /* (SDHC_TMR) Single Block  */
#define   SDHC_TMR_MSBSEL_MULTIPLE_Val        _UINT16_(0x1)                                        /* (SDHC_TMR) Multiple Block  */
#define SDHC_TMR_MSBSEL_SINGLE                (SDHC_TMR_MSBSEL_SINGLE_Val << SDHC_TMR_MSBSEL_Pos)  /* (SDHC_TMR) Single Block Position  */
#define SDHC_TMR_MSBSEL_MULTIPLE              (SDHC_TMR_MSBSEL_MULTIPLE_Val << SDHC_TMR_MSBSEL_Pos) /* (SDHC_TMR) Multiple Block Position  */
#define SDHC_TMR_Msk                          _UINT16_(0x003F)                                     /* (SDHC_TMR) Register Mask  */


/* -------- SDHC_WCR : (SDHC Offset: 0x2B) (R/W 8) Wakeup Control -------- */
#define SDHC_WCR_RESETVALUE                   _UINT8_(0x00)                                        /*  (SDHC_WCR) Wakeup Control  Reset Value */

#define SDHC_WCR_WKENCINT_Pos                 _UINT8_(0)                                           /* (SDHC_WCR) Wakeup Event Enable on Card Interrupt Position */
#define SDHC_WCR_WKENCINT_Msk                 (_UINT8_(0x1) << SDHC_WCR_WKENCINT_Pos)              /* (SDHC_WCR) Wakeup Event Enable on Card Interrupt Mask */
#define SDHC_WCR_WKENCINT(value)              (SDHC_WCR_WKENCINT_Msk & (_UINT8_(value) << SDHC_WCR_WKENCINT_Pos)) /* Assigment of value for WKENCINT in the SDHC_WCR register */
#define   SDHC_WCR_WKENCINT_DISABLE_Val       _UINT8_(0x0)                                         /* (SDHC_WCR) Disable  */
#define   SDHC_WCR_WKENCINT_ENABLE_Val        _UINT8_(0x1)                                         /* (SDHC_WCR) Enable  */
#define SDHC_WCR_WKENCINT_DISABLE             (SDHC_WCR_WKENCINT_DISABLE_Val << SDHC_WCR_WKENCINT_Pos) /* (SDHC_WCR) Disable Position  */
#define SDHC_WCR_WKENCINT_ENABLE              (SDHC_WCR_WKENCINT_ENABLE_Val << SDHC_WCR_WKENCINT_Pos) /* (SDHC_WCR) Enable Position  */
#define SDHC_WCR_WKENCINS_Pos                 _UINT8_(1)                                           /* (SDHC_WCR) Wakeup Event Enable on Card Insertion Position */
#define SDHC_WCR_WKENCINS_Msk                 (_UINT8_(0x1) << SDHC_WCR_WKENCINS_Pos)              /* (SDHC_WCR) Wakeup Event Enable on Card Insertion Mask */
#define SDHC_WCR_WKENCINS(value)              (SDHC_WCR_WKENCINS_Msk & (_UINT8_(value) << SDHC_WCR_WKENCINS_Pos)) /* Assigment of value for WKENCINS in the SDHC_WCR register */
#define   SDHC_WCR_WKENCINS_DISABLE_Val       _UINT8_(0x0)                                         /* (SDHC_WCR) Disable  */
#define   SDHC_WCR_WKENCINS_ENABLE_Val        _UINT8_(0x1)                                         /* (SDHC_WCR) Enable  */
#define SDHC_WCR_WKENCINS_DISABLE             (SDHC_WCR_WKENCINS_DISABLE_Val << SDHC_WCR_WKENCINS_Pos) /* (SDHC_WCR) Disable Position  */
#define SDHC_WCR_WKENCINS_ENABLE              (SDHC_WCR_WKENCINS_ENABLE_Val << SDHC_WCR_WKENCINS_Pos) /* (SDHC_WCR) Enable Position  */
#define SDHC_WCR_WKENCREM_Pos                 _UINT8_(2)                                           /* (SDHC_WCR) Wakeup Event Enable on Card Removal Position */
#define SDHC_WCR_WKENCREM_Msk                 (_UINT8_(0x1) << SDHC_WCR_WKENCREM_Pos)              /* (SDHC_WCR) Wakeup Event Enable on Card Removal Mask */
#define SDHC_WCR_WKENCREM(value)              (SDHC_WCR_WKENCREM_Msk & (_UINT8_(value) << SDHC_WCR_WKENCREM_Pos)) /* Assigment of value for WKENCREM in the SDHC_WCR register */
#define   SDHC_WCR_WKENCREM_DISABLE_Val       _UINT8_(0x0)                                         /* (SDHC_WCR) Disable  */
#define   SDHC_WCR_WKENCREM_ENABLE_Val        _UINT8_(0x1)                                         /* (SDHC_WCR) Enable  */
#define SDHC_WCR_WKENCREM_DISABLE             (SDHC_WCR_WKENCREM_DISABLE_Val << SDHC_WCR_WKENCREM_Pos) /* (SDHC_WCR) Disable Position  */
#define SDHC_WCR_WKENCREM_ENABLE              (SDHC_WCR_WKENCREM_ENABLE_Val << SDHC_WCR_WKENCREM_Pos) /* (SDHC_WCR) Enable Position  */
#define SDHC_WCR_Msk                          _UINT8_(0x07)                                        /* (SDHC_WCR) Register Mask  */


/** \brief SDHC register offsets definitions */
#define SDHC_ACESR_REG_OFST            _UINT32_(0x3C)      /* (SDHC_ACESR) Auto CMD Error Status Offset */
#define SDHC_ACR_REG_OFST              _UINT32_(0x208)     /* (SDHC_ACR) AHB Control Offset */
#define SDHC_AESR_REG_OFST             _UINT32_(0x54)      /* (SDHC_AESR) ADMA Error Status Offset */
#define SDHC_APSR_REG_OFST             _UINT32_(0x200)     /* (SDHC_APSR) Additional Present State Register Offset */
#define SDHC_ARG1R_REG_OFST            _UINT32_(0x08)      /* (SDHC_ARG1R) Argument 1 Offset */
#define SDHC_ASAR_REG_OFST             _UINT32_(0x58)      /* (SDHC_ASAR) ADMA System Address Offset */
#define SDHC_ASAR0_REG_OFST            _UINT32_(0x58)      /* (SDHC_ASAR0) ADMA System Address Offset */
#define SDHC_BCR_REG_OFST              _UINT32_(0x06)      /* (SDHC_BCR) Block Count Offset */
#define SDHC_BDPR_REG_OFST             _UINT32_(0x20)      /* (SDHC_BDPR) Buffer Data Port Offset */
#define SDHC_BGCR_REG_OFST             _UINT32_(0x2A)      /* (SDHC_BGCR) Block Gap Control Offset */
#define SDHC_BSR_REG_OFST              _UINT32_(0x04)      /* (SDHC_BSR) Block Size Offset */
#define SDHC_CA0R_REG_OFST             _UINT32_(0x40)      /* (SDHC_CA0R) Capabilities 0 Offset */
#define SDHC_CA1R_REG_OFST             _UINT32_(0x44)      /* (SDHC_CA1R) Capabilities 1 Offset */
#define SDHC_CACR_REG_OFST             _UINT32_(0x230)     /* (SDHC_CACR) Capabilities Control Offset */
#define SDHC_CC2R_REG_OFST             _UINT32_(0x20C)     /* (SDHC_CC2R) Clock Control 2 Offset */
#define SDHC_CCR_REG_OFST              _UINT32_(0x2C)      /* (SDHC_CCR) Clock Control Offset */
#define SDHC_CR_REG_OFST               _UINT32_(0x0E)      /* (SDHC_CR) Command Offset */
#define SDHC_DBGR_REG_OFST             _UINT32_(0x234)     /* (SDHC_DBGR) Debug Offset */
#define SDHC_EISIER_REG_OFST           _UINT32_(0x3A)      /* (SDHC_EISIER) Error Interrupt Signal Enable Offset */
#define SDHC_EISTER_REG_OFST           _UINT32_(0x36)      /* (SDHC_EISTER) Error Interrupt Status Enable Offset */
#define SDHC_EISTR_REG_OFST            _UINT32_(0x32)      /* (SDHC_EISTR) Error Interrupt Status Offset */
#define SDHC_FERACES_REG_OFST          _UINT32_(0x50)      /* (SDHC_FERACES) Force Event for Auto CMD Error Status Offset */
#define SDHC_FEREIS_REG_OFST           _UINT32_(0x52)      /* (SDHC_FEREIS) Force Event for Error Interrupt Status Offset */
#define SDHC_HC1R_REG_OFST             _UINT32_(0x28)      /* (SDHC_HC1R) Host Control 1 Offset */
#define SDHC_HC2R_REG_OFST             _UINT32_(0x3E)      /* (SDHC_HC2R) Host Control 2 Offset */
#define SDHC_HCVR_REG_OFST             _UINT32_(0xFE)      /* (SDHC_HCVR) Host Controller Version Offset */
#define SDHC_MC1R_REG_OFST             _UINT32_(0x204)     /* (SDHC_MC1R) MMC Control 1 Offset */
#define SDHC_MC2R_REG_OFST             _UINT32_(0x205)     /* (SDHC_MC2R) MMC Control 2 Offset */
#define SDHC_MCCAR_REG_OFST            _UINT32_(0x48)      /* (SDHC_MCCAR) Maximum Current Capabilities Offset */
#define SDHC_NISIER_REG_OFST           _UINT32_(0x38)      /* (SDHC_NISIER) Normal Interrupt Signal Enable Offset */
#define SDHC_NISTER_REG_OFST           _UINT32_(0x34)      /* (SDHC_NISTER) Normal Interrupt Status Enable Offset */
#define SDHC_NISTR_REG_OFST            _UINT32_(0x30)      /* (SDHC_NISTR) Normal Interrupt Status Offset */
#define SDHC_PCR_REG_OFST              _UINT32_(0x29)      /* (SDHC_PCR) Power Control Offset */
#define SDHC_PSR_REG_OFST              _UINT32_(0x24)      /* (SDHC_PSR) Present State Offset */
#define SDHC_PVR_REG_OFST              _UINT32_(0x60)      /* (SDHC_PVR) Preset Value n Offset */
#define SDHC_PVR0_REG_OFST             _UINT32_(0x60)      /* (SDHC_PVR0) Preset Value n Offset */
#define SDHC_PVR1_REG_OFST             _UINT32_(0x62)      /* (SDHC_PVR1) Preset Value n Offset */
#define SDHC_PVR2_REG_OFST             _UINT32_(0x64)      /* (SDHC_PVR2) Preset Value n Offset */
#define SDHC_PVR3_REG_OFST             _UINT32_(0x66)      /* (SDHC_PVR3) Preset Value n Offset */
#define SDHC_PVR4_REG_OFST             _UINT32_(0x68)      /* (SDHC_PVR4) Preset Value n Offset */
#define SDHC_PVR5_REG_OFST             _UINT32_(0x6A)      /* (SDHC_PVR5) Preset Value n Offset */
#define SDHC_PVR6_REG_OFST             _UINT32_(0x6C)      /* (SDHC_PVR6) Preset Value n Offset */
#define SDHC_PVR7_REG_OFST             _UINT32_(0x6E)      /* (SDHC_PVR7) Preset Value n Offset */
#define SDHC_RR_REG_OFST               _UINT32_(0x10)      /* (SDHC_RR) Response Offset */
#define SDHC_RR0_REG_OFST              _UINT32_(0x10)      /* (SDHC_RR0) Response Offset */
#define SDHC_RR1_REG_OFST              _UINT32_(0x14)      /* (SDHC_RR1) Response Offset */
#define SDHC_RR2_REG_OFST              _UINT32_(0x18)      /* (SDHC_RR2) Response Offset */
#define SDHC_RR3_REG_OFST              _UINT32_(0x1C)      /* (SDHC_RR3) Response Offset */
#define SDHC_SISR_REG_OFST             _UINT32_(0xFC)      /* (SDHC_SISR) Slot Interrupt Status Offset */
#define SDHC_SRR_REG_OFST              _UINT32_(0x2F)      /* (SDHC_SRR) Software Reset Offset */
#define SDHC_SSAR_REG_OFST             _UINT32_(0x00)      /* (SDHC_SSAR) SDMA System Address / Argument 2 Offset */
#define SDHC_TCR_REG_OFST              _UINT32_(0x2E)      /* (SDHC_TCR) Timeout Control Offset */
#define SDHC_TMR_REG_OFST              _UINT32_(0x0C)      /* (SDHC_TMR) Transfer Mode Offset */
#define SDHC_WCR_REG_OFST              _UINT32_(0x2B)      /* (SDHC_WCR) Wakeup Control Offset */

